<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Introducci&oacute;n a Java</title>
<META http-equiv=Content-Language content=es>
<META content="Programación en Java,Programas Java,Aplicaciones en Java,Ejercicios en Java, Ejemplos de Java,Tutorial de Java,Manual Java" name=description>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="keywords" content="Java, Manual Java, tutorial Java, Ejemplos Java, ejercicios Java">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos">

  <tr> 
    <td height="39" colspan="3"> <h2> <strong>Introducci&oacute;n a Java</strong></h2></td>
  </tr>
  <tr> 
    <td height="258" colspan="3"> <p>Java surgi&oacute; en 1991 cuando un grupo 
        de ingenieros de Sun Microsystems trataron de dise&ntilde;ar un nuevo 
        lenguaje de programaci&oacute;n destinado a electrodom&eacute;sticos. 
        La reducida potencia de c&aacute;lculo y memoria de los electrodom&eacute;sticos 
        llev&oacute; a desarrollar un lenguaje sencillo capaz de generar c&oacute;digo 
        de tama&ntilde;o muy reducido. </p>
      <p>Debido a la existencia de distintos tipos de CPUs y a los continuos cambios, 
        era importante conseguir una herramienta independiente del tipo de CPU 
        utilizada. Desarrollaron un c&oacute;digo &#8220;neutro&#8221; que no 
        depend&iacute;a del tipo de electrodom&eacute;stico, el cual se ejecutaba 
        sobre una &#8220;m&aacute;quina hipot&eacute;tica o virtual&#8221; denominada 
        Java Virtual Machine (JVM). Era la JVM quien interpretaba el c&oacute;digo 
        neutro convirti&eacute;ndolo a c&oacute;digo particular de la CPU utilizada. 
        Esto permit&iacute;a lo que luego se ha convertido en el principal lema 
        del lenguaje: &#8220;Write Once, Run Everywhere&#8221;. A pesar de los 
        esfuerzos realizados por sus creadores, ninguna empresa de electrodom&eacute;sticos 
        se interes&oacute; por el nuevo lenguaje. </p>
      <p>Como lenguaje de programaci&oacute;n para computadores, Java se introdujo 
        a finales de 1995. La clave fue la incorporaci&oacute;n de un int&eacute;rprete 
        Java en la versi&oacute;n 2.0 del programa Netscape Navigator, produciendo 
        una verdadera revoluci&oacute;n en Internet. Java 1.1 apareci&oacute; 
        a principios de 1997, mejorando sustancialmente la primera versi&oacute;n 
        del lenguaje. Java 1.2, m&aacute;s tarde rebautizado como Java 2, naci&oacute; 
        a finales de 1998. </p>
      <p>Al programar en Java no se parte de cero. Cualquier aplicaci&oacute;n 
        que se desarrolle &#8220;cuelga&#8221; (o se apoya, seg&uacute;n como 
        se quiera ver) en un gran n&uacute;mero de clases preexistentes. Algunas 
        de ellas las ha podido hacer el propio usuario, otras pueden ser comerciales, 
        pero siempre hay un n&uacute;mero muy importante de clases que forman 
        parte del propio lenguaje (el API o Application Programming Interface 
        de Java). Java incorpora en el propio lenguaje muchos aspectos que en 
        cualquier otro lenguaje son extensiones propiedad de empresas de software 
        o fabricantes de ordenadores (threads, ejecuci&oacute;n remota, componentes, 
        seguridad, acceso a bases de datos, etc.). Por eso muchos expertos opinan 
        que Java es el lenguaje ideal para aprender la inform&aacute;tica moderna, 
        porque incorpora todos estos conceptos de un modo est&aacute;ndar, mucho 
        m&aacute;s sencillo y claro que con las citadas extensiones de otros lenguajes. 
        Esto es consecuencia de haber sido dise&ntilde;ado m&aacute;s recientemente 
        y por un &uacute;nico equipo. El principal objetivo del lenguaje Java 
        es llegar a ser el &#8220;nexo universal&#8221; que conecte a los usuarios 
        con la informaci&oacute;n, est&eacute; &eacute;sta situada en el ordenador 
        local, en un servidor de Web, en una base de datos o en cualquier otro 
        lugar. </p>
      <p>Java es un lenguaje muy completo (de hecho se est&aacute; convirtiendo 
        en un macro-lenguaje: Java 1.0 ten&iacute;a 12 packages; Java 1.1 ten&iacute;a 
        23 y Java 1.2 tiene 59). En cierta forma casi todo depende de casi todo. 
        Por ello, conviene aprenderlo de modo iterativo: primero una visi&oacute;n 
        muy general, que se va refinando en sucesivas iteraciones. Una forma de 
        hacerlo es empezar con un ejemplo completo en el que ya aparecen algunas 
        de las caracter&iacute;sticas m&aacute;s importantes. La compa&ntilde;&iacute;a 
        Sun describe el lenguaje Java como &#8220;simple, orientado a objetos, 
        distribuido, interpretado, robusto, seguro, de arquitectura neutra, portable, 
        de altas prestaciones, multitarea y din&aacute;mico&#8221;.</p>
      <p> Adem&aacute;s de una serie de halagos por parte de Sun hacia su propia 
        criatura, el hecho es que todo ello describe bastante bien el lenguaje 
        Java, aunque en algunas de esas caracter&iacute;sticas el lenguaje sea 
        todav&iacute;a bastante mejorable. Algunas de las anteriores ideas se 
        ir&aacute;n explicando a lo largo de este manual. </p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
