<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Formularios</title><META http-equiv=Content-Language content=es><META content="Programación,Programas,Aplicaciones,Ejercicios, Ejemplos,Tutoriales,Manuales" name=description>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
 
<meta name="keywords" content="Formularios, elementos de un formulario, Html, Lenguaje Html, Manual Html, Tutorial, ejercicios Html">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
  <link href="../styles/estilos.css" rel="stylesheet" type="text/css"></head>
  
<body>
<table width="555" height="1415" align="left" background="../imagenes/fondologo.jpg">
  <tr> 
    <td height="38" colspan="2"> <h2>Formularios</h2></td>
  </tr>
  <tr> 
    <td height="1255" colspan="2"> <table width="62%" border="0"  >
        <tr> 
          <td width="28%"  ><h3>Contenido:</h3></td>
          <td width="72%">&nbsp;</td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td><a href="htm09.htm#intro">- Introducci&oacute;n</a></td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td><a href="htm09.htm#frameset">- atributos comunes</a></td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td><a href="htm09.htm#frame">- Marca &lt;FORM&gt;</a></td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td><a href="htm09.htm#noframes">- Marca &lt;INPUT&gt;</a></td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td><a href="htm09.htm#target1">- La marca &lt;SELECT&gt;</a></td>
        </tr>
        <tr> 
          <td>&nbsp;</td>
          <td><a href="htm09.htm#itextarea">- La marca &lt;TEXTAREA&gt;</a></td>
        </tr>
      </table>
      <h3>  Introducci&oacute;n  <a name="intro"></a></h3>
       <p>Los formularios generan en la pantalla cuadros de 
        di&aacute;logo con el lector permitiendo as&iacute; la interacci&oacute;n 
        con el usuario para consultar las bases de datos, solicitudes de documentaci&oacute;n....
        Se podr&aacute;n tener zonas en las que se introducir&aacute; un texto, 
        casillas de verificaci&oacute;nm, listas de selecci&oacute;n, etc...
        Para la creaci&oacute;n de formularios se utilizan las siguientes marcas:
      <blockquote  >- FORM que delimita el comienzo y el fin 
        de la definición del formulario.
        - INPUT que permite crear diferentes tipos de entradas: campo de edici&oacute;n 
        y diversos tipos de botones. 
        - SELECT que permite crear listas, men&uacute;s desplegables y listas 
        con barras de desplazamiento.
        - TEXTAREA que genera una zona de edici&oacute;n de texto libre.</blockquote>
      <p></p>
       <h3>  Atributos comunes  <a name="frameset"></a></h3>
       <p>El atributo NAME define el nombre que permitir&aacute; 
        al script identificar el origen de datos. El atributo Value puede ser 
        definido para un campo de: 
      <blockquote  >- Texto
        - Bot&oacute;n SUBMIT
        - Bot&oacute;n RADIO y CHECKBOX</blockquote>
      <p></p>
       <h3>  FORM  <a name="frame"></a></h3>
       <p>La marca &lt;FORM&gt; y &lt;/FORM&gt; definen un 
        formulario, y entre ellas se situar&aacute;n todas las marcas que generen 
        los diversos elementos que componen un formulario. Esta marca debe ir 
        acompa&ntilde;ada por dos atributos: 
      <blockquote  >- METHOD, al que puede darse el valor post 
        o get.
        - ACTION define la acci&oacute;n a ejecutar cuando se pulse el bot&oacute;n 
        de sumisi&oacute;n.</blockquote>
       <h3>  INPUT  <a name="noframes"></a></h3>
       <p>La marca &lt;INPUT&gt; servir&aacute; para definir 
        campos para entrar un texto y botones que permiten escoger opciones. Permite 
        varios atributos: 
      <blockquote  >- SIZE, define la longitud de la ventana. 
        
        - MAXLENGTH define la m&aacute;xima longitud de la cadena</blockquote>
      <p></p>
         El atributo TYPE asociado a la marca INPUT permite 
      la selecci&oacute;n del elemento de entrada, y puede tomar los valores:   
      <blockquote  >- TEXT define una zona de entrada de texto 
        simple.
        - SUBMIT desencadena el env&iacute;o del formulario hacia el script.
        - RESET permite borrar los datos ya entrados.
        - PASSWORD permite crear una palabra clave de forma confidencial.
        - CHEKBOX crea un bloque de botones que permite una selecci&oacute;n m&uacute;ltiple 
        de opciones.
        - RADIO Crea un bloque de botones que permiten una selecci&oacute;n exclusiva 
        entre varias ordenes.
        - HIDDEN sirve para pasar datos de un formulario a otro sin que se vea 
        nada en pantalla 
        - IMAGE hace que el visualizador presente una imagen que es sensible al 
        ratón </blockquote>
       <h3>  SELECT  <a name="target1"></a></h3>
       <p>La marca &lt;SELECT&gt; permite generar listas de 
        selecci&oacute;n simple o de selecci&oacute;n variable. Se programa con 
        una lista en la que los items se especifican con la marca &lt;OPTION&gt;.</p>
       <h3>  TEXTAREA  <a name="Itextarea" id="Itextarea"></a></h3>
       <p>La marca &lt;TEXTAREA&gt; permite crear una ventana 
        con barras de desplazamiento horizontales y verticales en las que se podr&aacute; 
        escribir texto. El tama&ntilde;o dado a los atributos ROWS y COLS delimita 
        el tama&ntilde;o de esta ventana.</p>
       <p>Es posible definir un texto (entre las marcas &lt;TEXTAREA&gt;&lt;/TEXTAREA&gt;) 
        que el usuario podr&aacute; reemplazar o completar con su propio texto.</p></td>
  </tr>
  <tr> 
    <td width="70" height="21"> </td>
    <td height="21"><div align="right"> <a href="../index3.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
