<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Introducci&oacute;n a AJAX</title>
<META http-equiv=Content-Language content=es>
<META content="Programación,Programas,Aplicaciones,Ejercicios, Ejemplos,Tutoriales,Manuales" name=description>
<meta name="keywords" content="Introduccion a AJAX, Manual AJAX, tutorial AJAX, Ejemplos AJAX, ejercicios AJAX">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table width="555" height="534" align="left" background="../../imagenes/fondologo.jpg">
  <tr> 
    <td height="39" colspan="3"> <h2>Introducci&oacute;n a AJAX</h2></td>
  </tr>
  <tr> 
    <td height="464" colspan="3"> 
      <h3>Introducci&oacute;n</h3>
      <p>La historia de AJAX est&aacute; &iacute;ntimamente relacionada con un 
        objeto de programaci&oacute;n llamado XMLHttpRequest. El origen de este 
        objeto se remonta al a&ntilde;o 2000, con productos como Exchange 2000, 
        Internet Explorer 5 y Outlook Web Access.<br>
        Todo comenz&oacute; en 1998, cuando Alex Hopmann y su equipo se encontraban 
        desarrollando la entonces futura versi&oacute;n de Exchange 2000. El punto 
        d&eacute;bil del servidor de correo electr&oacute;nico era su cliente 
        v&iacute;a web, llamado OWA (Outlook Web Access).<br>
        Durante el desarrollo de OWA, se evaluaron dos opciones: un cliente formado 
        s&oacute;lo por p&aacute;ginas HTML est&aacute;ticas que se recargaban 
        constantemente y un cliente realizado completamente con HTML din&aacute;mico 
        o DHTML. Alex Hopmann pudo ver las dos opciones y se decant&oacute; por 
        la basada en DHTML. Sin embargo, para ser realmente &uacute;til a esta 
        &uacute;ltima le faltaba un componente esencial:<br>
        &quot;algo&quot; que evitara tener que enviar continuamente los formularios 
        con datos al servidor.<br>
        Motivado por las posibilidades futuras de OWA, Alex cre&oacute; en un 
        solo fin de semana la primera versi&oacute;n de lo que denomin&oacute; 
        XMLHTTP. La primera demostraci&oacute;n de las posibilidades de la nueva 
        tecnolog&iacute;a fue un &eacute;xito, pero faltaba lo m&aacute;s dif&iacute;cil: 
        incluir esa tecnolog&iacute;a en el navegador Internet Explorer.<br>
        Si el navegador no inclu&iacute;a XMLHTTP de forma nativa, el &eacute;xito 
        del OWA se habr&iacute;a reducido enormemente. El mayor problema es que 
        faltaban pocas semanas para que se lanzara la &uacute;ltima beta de Internet 
        Explorer 5 previa a su lanzamiento final. Gracias a sus contactos en la 
        empresa, Alex consigui&oacute; que su tecnolog&iacute;a se incluyera en 
        la librer&iacute;a MSXML que incluye Internet Explorer.<br>
        De hecho, el nombre del objeto (XMLHTTP) se eligi&oacute; para tener una 
        buena excusa que justificara su inclusi&oacute;n en la librer&iacute;a 
        XML de Internet Explorer, ya que este objeto est&aacute; mucho m&aacute;s 
        relacionado con HTTP que con XML.</p>
      <p></p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
