<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>LIntroducci&amp;oacute;n a XSL</title>
<META http-equiv=Content-Language content=es>
<META content="Programación en CSS,Programas CSS,Aplicaciones en CSS,Ejercicios en CSS, Ejemplos de CSS,Tutoriales de CSS,Manuales CSS" name=description>
<meta name="keywords" content="CSS, Manual CSS, tutorial CSS, Ejemplos CSS, ejercicios CSS, Cascading Style Sheet">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table width="555" height="329" align="left" background="../imagenes/fondologo.jpg">
  <tr> 
    <td height="39" colspan="3"> <h2> <strong>Introducci&oacute;n a XSL </strong></h2></td>
  </tr>
  <tr> 
    <td height="258" colspan="3"> 
      <p>El XSL (extensive stylesheet language) es un lenguaje que nos permite definir una presentacion o formato para un documento XML. Un mismo documento XML puede tener varias hojas de estilo XSL que lo muestren en diferentes formatos (HTML,PDF, RTF, VRML,POSTSCRIPT, sonido….). En definitiva, el XSL se puede definir como un lenguaje de hojas de estilo que nos permite dar al XML un formato de salido,(el XSL no es m&aacute;s que un documento XML por lo que debe ser v&aacute;lido). </p>
      <p>&nbsp; </p>
      <p>El XML describe los contenidos , el XSL la presentaci&oacute;n mientras que el HTML mezcla contenidos con presentaci&oacute;n. Para describir c&oacute;mo se deben presentar los documentos XML podemos optar por dos soluciones: las CSS que se utilizan en HTML y las descripciones que se basan en XSL. CSS es eficaz para describir formatos y presentaciones, pero no sirve para decidir que tipos de datos deben ser mostrados y cuales no deben salir en pantalla. Esto es, CSS se utiliza con documentos XML en los casos en los que todo su contenido debe mostrarse sin mayor problema. XSL no solo permite especificar como queremos presentar los datos del documento XML, sino que tambien sirve para filtrar los datos de acuerdo a ciertas condiciones. Se parece un poco mas a un lenguaje de programaci&oacute;n. El XSL a&ntilde;ade al XML, ademas del aspecto que ya inclu&iacute;a CSS referente a la presentaci&oacute;n y estilo de los elementos del documento , una peque&ntilde;a sintaxis de lenguaje xcript para poder procesar los documentos XML de forma m&aacute;s c&oacute;moda. Adem&aacute;s XSL no es incompatible con las CSS, es decir que podemos utilizar ambos formatos para la presentaci&oacute;n de documentos. </p>
      <p>Lo que se pretende con la hoja de estilos es realizar una transformaci&oacute;n desde un documento XML a un arbol resultante. Para ello necesitamos saber la jerarqu&iacute;a del XML. Los formatos de salida (arbol resultante) de este proceso de transformaci&oacute;n son HTML, XSL o texto. Tambien existen otros formatos como PDF, pero este utiliza XSLT para seleccionar y FO-XSL para formatear el documento. </p>
      <p>Mientras que al documento HTML s&oacute;lo se le pod&iacute;a aplicar una CSS para presentarlo, al XML le puedo aplicar, un lenguaje de formateo(XSL-FO), una CSS o un lenguaje de transformaci&oacute;n (XSLT), hasta llegar a la presentaci&oacute;n. Las CSS las interpreta el navegador , pero el XSLT o el XSL-FO necesitan un procesador para poder verse los resultados. </p>
      <p>&nbsp; </p>
      <p>El documento XML tiene una estructura de &aacute;rbol, donde cada etiqueta corresponde a un nodo del &aacute;rbol. Como todos sabemos , el documento XML tiene que estar bien formado por lo que tiene que existir una etiqueta ra&iacute;z que contiene el resto de elementos; sin embargo, esta no es la ra&iacute;z del &aacute;rbol XML, existe otra que contiene (“/”). </p>
    <h3>&nbsp;</h3>    </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index3.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
