<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>&iquest;Qu&eacute; es JDBC?</title>
<META http-equiv=Content-Language content=es>
<META content="Programación en JDBC,Programas JDBC,Aplicaciones en JDBC,Ejercicios en JDBC, Ejemplos de JDBC,Tutoriales de JDBC,Manuales JDBC" name=description>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="keywords" content="JDBC, Manual JDBC, tutorial JDBC, Ejemplos JDBC, ejercicios JDBC">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos">

  <tr> 
    <td height="39" colspan="3"> <h2> <strong>&iquest;Qu&eacute; es JDBC?</strong></h2></td>
  </tr>
  <tr> 
    <td height="258" colspan="3"> <p>JDBC es el API para la ejecuci&oacute;n de 
        sentencias SQL. (Como punto de inter&eacute;s JDBC es una marca registrada 
        y no un acr&oacute;nimo, no obstante a menudo es conocido como &#8220;Java 
        Database Connectivity&#8221;). Consiste en un conjunto de clases e interfases 
        escritas en el lenguaje de programaci&oacute;n Java. JDBC suministra un 
        API est&aacute;ndar para los desarrolladores y hace posible escribir aplicaciones 
        de base de datos usando un API puro Java.</p>
      <p>Usando JDBC es f&aacute;cil enviar sentencias SQL virtualmente a cualquier 
        sistema de base de datos. En otras palabras, con el API JDBC, no es necesario 
        escribir un programa que acceda a una base de datos Sybase, otro para 
        acceder a Oracle y otro para acceder a Informix. Un &uacute;nico programa 
        escrito usando el API JDBC y el programa ser&aacute; capaz de enviar sentencias 
        SQL a la base de datos apropiada. Y, con una aplicaci&oacute;n escrita 
        en el lenguaje de programaci&oacute;n Java, tampoco es necesario escribir 
        diferentes aplicaciones para ejecutar en diferentes plataformas. La combinaci&oacute;n 
        de Java y JDBC permite al programador escribir una sola vez y ejecutarlo 
        en cualquier entorno.</p>
      <p>Java, siendo robusto, seguro, f&aacute;cil de usar, f&aacute;cil de entender, 
        y descargable autom&aacute;ticamente desde la red, es un lenguaje base 
        excelente para aplicaciones de base de datos. <br>
        <br>
        JDBC expande las posibilidades de Java. Por ejemplo, con Java y JDBC API, 
        es posible publicar una p&aacute;gina web que contenga un applet que usa 
        informaci&oacute;n obtenida de una base de datos remota. O una empresa 
        puede usar JDBC para conectar a todos sus empleados (incluso si usan un 
        conglomerado de m&aacute;quinas Windows, Macintosh y UNIX) a una base 
        de datos interna v&iacute;a intranet. Con cada vez m&aacute;s y m&aacute;s 
        programadores desarrollando en lenguaje Java, la necesidad de acceso f&aacute;cil 
        a base de datos desde Java contin&uacute;a creciendo.<br>
      </p>
      <p>&nbsp; </p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
