<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Introduccion al desarrollo de aplicaciones informaticas</title>
<META http-equiv=Content-Language content=es>
<META content="Introduccion al desarrollo de aplicaciones informaticas" name=description>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="keywords" content="Introduccion al desarrollo de aplicaciones informaticas">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos">

  <tr> 
    <td height="39" colspan="3"> <h2> Sistemas de informaci&oacute;n</h2></td>
  </tr>
  <tr> 
    <td height="258" colspan="3"> <h3>La Empresa </h3>
	  <p>Podemos definir una empresa como una unidad econ&oacute;mica de producci&oacute;n, 
        cuya finalidad es la de crear o aumentar la utilidad de los bienes, para 
        satisfacer las necesidades humanas. Los fines de la empresa son los siguientes:<br>
        - Conseguir los objetivos<br>
        - Obtener el m&aacute;ximo rendimiento (Beneficio)<br>
        - Prestar un servicio a la sociedad<br>
        Las funciones de la empresa son:<br>
        - Gen&eacute;rica:<br>
        o Financiera, es decir, conseguir los recursos.<br>
        o Contable (Movimiento econ&oacute;mico)<br>
        o Direcci&oacute;n administrativa (Llevar el control de la empresa)<br>
        o De recursos humanos<br>
        - Productivas:<br>
        o Comercial o de marketing, que intentan la obtenci&oacute;n de nuevos 
        clientes o proveedores<br>
        o Producci&oacute;n: Dentro se encuentran las tareas de fabricaci&oacute;n 
        y aplicaci&oacute;n.<br>
        - Otras funciones:<br>
        o Investigaci&oacute;n y Desarrollo (I+D), para crear otros productos 
        o procesos<br>
        ? Seguridad, para el buen funcionamiento de todos los .</p>
      <p><img src="../../imagenes/analisis/tema2/image001.gif" width="665" height="228"></p>
<h3> El empresario: </h3><p>Es la persona o personas responsable(s) de una empresa.<br>
        Los fines y funciones del empresario son:<br>
        - Coordinaci&oacute;n del proceso productivo<br>
        - Definici&oacute;n de objetivos y toma de decisiones</p>
      <p><h3>
        La Empresa como Subsistema </h3>
        
        Definici&oacute;n de sistema: Un sistema es un conjunto de elementos que 
        interaccionan entre s&iacute; para alcanzar un objetivo com&uacute;n.<br>
        Los elementos tienen que estar definidos, ser distinguibles y medibles.<br>
        Los l&iacute;mites o fronteras nos tienen que indicar los requisitos que 
        son necesarios para el an&aacute;lisis.<br>
        Los objetivos nos indican hacia donde tienden los elementos.<br>
        La interacci&oacute;n entre los elementos nos indica c&oacute;mo cada 
        elemento influye en los dem&aacute;s, y como el conjunto de todos los 
        elementos influye en el resultado del sistema.<br>
        Siempre que la empresa se plantee un problema tendr&aacute; que seguir 
        los siguientes pasos: </p>
      <p><img src="../../imagenes/analisis/tema2/image002.gif" width="359" height="359"></p>
      <p>El sistema empresa esta constituido por los siguientes subsistemas:<br>
        - El real, es decir, todos los elementos que intervienen directamente 
        en la producci&oacute;n.<br>
        - El financiero, es decir, el que se dedica a la captaci&oacute;n, administraci&oacute;n 
        y control de los recursos.<br>
        - El directivo, que es el que define los objetivos, toma las decisiones 
        y controla el funcionamiento de la empresa. </p>
      <p><img src="../../imagenes/analisis/tema2/image003.gif" width="569" height="200"></p>
      <h3>Departamentos de la empresa </h3>
      <p>Las funciones de cada departamento vienen dadas por los siguientes elementos:<br>
        - De ejecuci&oacute;n, que son los que permiten alcanzar un fin<br>
        - De servicio, que son las entradas a las funciones de ejecuci&oacute;n<br>
        - Finalistas, es decir, todos aquellos elementos que cooperan con la ejecuci&oacute;n, 
        como pueden ser compras, ventas, producci&oacute;n&#8230;<br>
        - Asesor&iacute;a, es decir, la creaci&oacute;n de informes y la evaluaci&oacute;n 
        de las tareas<br>
        <img src="../../imagenes/analisis/tema2/image004.gif" width="569" height="281"> 
      </p>
      <p>Departamentos en la empresa: Dependiendo del departamento de direcci&oacute;n, 
        estar&aacute;n todos los departamentos que componen la empresa (Dep. administrativo, 
        financiero, recursos humanos, marketing, producci&oacute;n y comercial)<br>
        [Esk T2D5]<br>
        Departamento de producci&oacute;n: Es el encargado de la transformaci&oacute;n 
        de las materias primas en productos elaborados para su posterior venta. 
        Para transformar las materias primas se utilizan todos los recursos de 
        que dispone la empresa. <br>
        [Esk T2D6]<br>
        Departamento comercial y de marketing: Son los encargados de las entradas, 
        es decir, reciben las materias primas, y de las salidas, es decir, una 
        vez que se tienen los productos elaborados son los encargados de venderlos. 
        Para ello, utilizan los siguientes procesos:<br>
        [Dib. T2D7]<br>
        Departamento de recursos humanos: Es el encargado de los recursos laborales 
        y sociales del personal de la empresa. En el se realizan los siguientes 
        procesos:<br>
        - Selecci&oacute;n y formaci&oacute;n del profesional<br>
        - Se dise&ntilde;an los sistemas de motivaci&oacute;n<br>
        - Se busca el liderazgo<br>
        - Relaciones laborales<br>
        - Jur&iacute;dico-laboral</p>
      <p>
        Departamento financiero: Controla las entradas y salidas de dinero. 
        [Dib. T2D9]<br>
        Departamento de administraci&oacute;n: Controla la realizaci&oacute;n 
        de los trabajos administrativos dentro de la empresa.<br>
        [Dib. T2D10]<br>
        Departamento de direcci&oacute;n: Dirige y controla todos los elementos 
        de la empresa.<br>
        [Dib. T2D11]</p>
      <p></p>
      <h3>Estructura socio-organizativa de la empresa </h3>
        <br>
        Definici&oacute;n de estructura: Conjunto de elementos relacionados entre 
        s&iacute; que act&uacute;an conjuntamente para la obtenci&oacute;n de 
        un objetivo.<br>
        [Dib. T2D12]<br>
        La estructura socio-organizativa de la empresa nos muestra como se relacionan 
        las personas que forman parte de una empresa. Las relaciones que se generan 
        son jer&aacute;rquicas. Las relaciones jer&aacute;rquicas son aquellas 
        que se establecen entre superiores y subordinados. Los superiores transmiten 
        los objetivos y las decisiones y los subordinados las ejecutan. <br>
        [Dib. T2D13]<br>
        Coordinaci&oacute;n: Cada superior conoce y controla el trabajo de sus 
        subordinados.<br>
        Unidad de mando: Cada empleado solo tiene un superior directo. Cada superior 
        sabe quienes son sus empleados.<br>
        Simplicidad, eficacia y responsabilidad: Solo realiza aquello que es necesario, 
        y para realizarlo se utiliza la forma m&aacute;s sencilla.<br>
        Divisi&oacute;n y especializaci&oacute;n de trabajo: Cada empleado ha 
        de saber las tareas que tiene que desempe&ntilde;ar.<br>
        Organizaci&oacute;n formal: Es la asignaci&oacute;n de recursos para conseguir 
        la productividad en el menor tiempo posible. La eficacia viene dada por 
        la formula: <br>
        &#8220;Mayor productividad / unidad de tiempo y menor coste posible&#8221;</p>
      <p>EFICACIA = f PRODUCCION + f&#8217; TIEMPO + f&#8217;&#8217; COSTE<br>
        -M&Aacute;XIMA- -M&Aacute;XIMA- -M&Iacute;NIMO- -M&Iacute;NIMO-</p>
      <p> Los principios sobre los que se basa la organizaci&oacute;n formal son 
        los siguientes:<br>
        - Principio de jerarqu&iacute;a o escalar: Establece las relaciones entre 
        superiores y subordinados. Se indican la distribuci&oacute;n de tareas 
        y las exigencias de responsabilidad. A mayor nivel de autoridad, mayor 
        responsabilidad. Los niveles de autoridad en la empresa son:<br>
        o Directivo (El de mayor autoridad)<br>
        o Gestores (Subordinados que poseen a su vez, subordinados)<br>
        o Productores (No poseen subordinados)</p>
      <p>Las relaciones entre unos niveles y otros son de tipo jer&aacute;rquico<br>
        [Dib. T2D14]<br>
        [Dib. T2D15]<br>
        - Segundo Principio de divisi&oacute;n de trabajo: gracias a este principio 
        es f&aacute;cil identificar a todos los elementos de la empresa. Tanto 
        humanos como f&iacute;sicos ya que a cada uno se le asigna una tarea, 
        es decir, se utiliza el principio jer&aacute;rquico de la asignaci&oacute;n.<br>
        - Tercer Principio de la especializaci&oacute;n: este principio hace que 
        aparezcan puestos de trabajo con perfiles muy definidos. La especializaron 
        es una consecuencia de la divisi&oacute;n de trabajo y de la utilizaci&oacute;n 
        de nuevas tecnolog&iacute;as. Mintzberg describe la estructura de la empresa 
        de la siguiente forma.<br>
        - Nivel superior: es el estrat&eacute;gico, donde se toman las decisiones 
        en el se encuentra la direcci&oacute;n de la empresa.<br>
        - Parte central: Es el nivel t&aacute;ctico. En el se realizan las siguientes 
        funciones comunicaci&oacute;n de las ordenes de direcci&oacute;n y todos 
        los trabajos de las &aacute;reas financieras, comercial y de marketing.<br>
        - Nivel inferior: es el nivel operativo, en el se encuentra la &aacute;rea 
        de producci&oacute;n con los operarios de nivel operativo, comerciales, 
        vendedores, transportistas.<br>
        [Dib. T2D16]</p>
      <p><br>
        Tipos de organizaci&oacute;n formal<br>
        -la organizaci&oacute;n jer&aacute;rquico-lineal: la empresa es una estructura 
        jer&aacute;rquica en la que se establece comunicaciones entre sus elementos. 
        Estas comunicaciones pueden ser de dos tipos: &oacute;rdenes y resultados. 
        Las ordenes son las que se transmiten de superiores a subordinados y los 
        resultados se transmiten de subordinados a superiores. [T2D17] <br>
        La representaci&oacute;n de las diferentes estructuras pasa por la definici&oacute;n 
        de cada nivel de autoridad y el staff dependiente de ello. El staff es 
        un &Oacute;rgano consultivo de un departamento que ayuda a tomar decisiones. 
        [T2D18]<br>
        Esta representaci&oacute;n jer&aacute;rquica se puede superponer a la 
        estructura piramidal de Mintzberg. [T2D19]<br>
        Las estructuras organizativas son sistemas de transmisi&oacute;n de flujos 
        y estos flujos pueden ser de informaci&oacute;n, decisi&oacute;n, control 
        y de trabajo operativo.<br>
        Flujos de trabajo operativo: Pueden ser de tres tipos.<br>
        1&ordm; Tipo? Secuencias, cuando existe una &uacute;nica cadena de montaje. 
        [T2D20]<br>
        2&ordm; Tipo? Mancomunados (existen varias l&iacute;neas de montaje paralelas, 
        que s&oacute;lo comparten los recursos. [T2D21]<br>
        3&ordm; Tipo? Rec&iacute;procos: un operario termina un producto que regresa 
        a la cadena para completarlo. [T2D22]</p>
      <p>Flujos de control: Se encarga de regular los flujos de toma de decisiones 
        y de informaci&oacute;n. La toma de decisiones va desde el nivel estrat&eacute;gico 
        al operativo. Una decisi&oacute;n estrat&eacute;gica va bajando niveles 
        hasta llegar a ser operativa. Por ejemplo, una decisi&oacute;n estrat&eacute;gica 
        de aumento de la calidad. Va bajando niveles, hasta llegar al nivel operativo 
        de almac&eacute;n, de compras, de corte de metal, de corte de cristal, 
        montaje de aluminio, montaje de cristal, empaquetado y distribuci&oacute;n. 
        Comprobamos que una decisi&oacute;n estrat&eacute;gica se ha convertido 
        en ocho del nivel operativo. [T2D23]</p>
      <p>Toda la informaci&oacute;n queda centralizada en un MIS (Management Information 
        System) La informaci&oacute;n se concentra al llegar al nivel estrat&eacute;gico 
        y se expande cuando se est&aacute; en los niveles operativos.</p>
      <p>El Staff: Cuando se producen flujos transversales se debe a la existencia 
        del Staff. El Staff es un conjunto de asesores de decisi&oacute;n e informaci&oacute;n 
        que establecen niveles estrat&eacute;gicos y t&aacute;cticos. Los Staff 
        est&aacute;n formados por t&eacute;cnicos financieros, legislativos, comerciales, 
        y de producci&oacute;n. </p>
      <p>Organizaci&oacute;n informal: Aparece por la comunicaci&oacute;n entre 
        personas de distintos niveles. Forma parte del ser humano, ya que &eacute;l 
        elige los compa&ntilde;eros, los amigos, personas con intereses afines, 
        crea grupos de presi&oacute;n, grupos de poder&#8230; Este tipo de organizaci&oacute;n 
        surge para evitar la rigidez de las l&iacute;neas jer&aacute;rquicas. 
        Los organigramas que reflejan la comunicaci&oacute;n de informaci&oacute;n 
        en una estructura informal son los sociogramas, y var&iacute;an de una 
        empresa a otra. Las causas de las organizaciones informales son bien de 
        naturaleza laboral, o bien de naturaleza social, y surgen porque es m&aacute;s 
        f&aacute;cil la comunicaci&oacute;n verbal que escribir un protocolo de 
        actuaci&oacute;n. </p>
      <p>a) Tipos de Organizaci&oacute;n Informal: </p>
      <p>- Redes de comunicaci&oacute;n: Se dan entre personas de distintos niveles 
        jer&aacute;rquicos.<br>
        - Constelaciones: Se dan entre tipos de personas del mismo nivel que realizan 
        trabajos en com&uacute;n.</p>
      <p>b) Redes de comunicaci&oacute;n informal: </p>
      <p>Presenta las siguientes l&iacute;neas:<br>
        -Primera l&iacute;nea: Entre compa&ntilde;eros: sin realizar las comunicaciones 
        a trav&eacute;s de sus jefes.<br>
        -Segunda l&iacute;nea: Entre un superior jer&aacute;rquico y un subordinado 
        de otro superior del mis nivel en diagonal.<br>
        -Tercera l&iacute;nea: Entre superiores y subordinados produciendo saltos 
        entres l&iacute;neas. [T2D25]</p>
      <p>Hay personas encargadas en unir estas tres l&iacute;neas dando origen 
        a mallas o redes de comunicaci&oacute;n, esta red de comunicaci&oacute;n 
        no entran en el MIS porque no es una comunicaci&oacute;n estructurada.</p>
      <p>c) Constelaciones de trabajo: </p>
      <p>Lo forman todas aquellas comunicaciones que se dan entre los distintos 
        niveles de la empresa y que tienen que tomarse en cuenta cuando se dise&ntilde;an 
        o analizan las aplicaciones. Estas comunicaciones pueden darse entre personas 
        de un mismo nivel, entre personas que trabajan en com&uacute;n, entre 
        las que comparten informaci&oacute;n y entre las que poseen intereses 
        comunes. Son organizaciones cerradas e independientes entre si. Algunas 
        de estas constelaciones pueden llegar a tener carta de naturaleza en la 
        empresa y transformarse en comit&eacute;s consultivos o ejecutivos. [T2D26]</p>
      <p></p>
      <p></p>
      <p><br>
        Organizaci&oacute;n funcional: Con esta organizaci&oacute;n se sustituye 
        las estructuras jer&aacute;rquicas por otro modelo en el que aparecen 
        &oacute;rganos o grupos especializados en tareas t&eacute;cnicas con capacidad 
        de decisi&oacute;n, la capacidad de decisi&oacute;n es lo que les diferencia 
        de los staff. Las caracter&iacute;sticas de este tipo de organizaci&oacute;n 
        son:<br>
        - Principio de especializaci&oacute;n: Cada elemento de la organizaci&oacute;n 
        funcional esta especializado en diversas tareas.</p>
      <p>Tareas + Decisiones = &Oacute;rgano </p>
      <p>- Como consecuencia del principio anterior se modifica la unidad de mando 
        cada subordinado posee un superior o conjunto de superiores no jer&aacute;rquico 
        sino funcional.<br>
        - Si cada subordinado posee m&aacute;s de un superior se crea una red 
        de comunicaciones entre el primero y alguno de los segundos.<br>
        - La decisi&oacute;n y la ejecuci&oacute;n est&aacute;n descentralizadas 
        ya que cada &oacute;rgano posee competencias.</p>
      <p>Inconvenientes de este tipo de comunicaci&oacute;n:<br>
        - la dificultad de comunicaci&oacute;n entre &oacute;rganos.<br>
        - La fragmentaci&oacute;n de la autoridad y como consecuencia de ello 
        la p&eacute;rdida de responsabilidad.</p>
      <h3> Sistemas de informaci&oacute;n en la empresa</h3>
      <p>Necesidades de la informaci&oacute;n dentro de la empresa pro sistemas 
        de informaci&oacute;n son un elemento necesario ya que estos sistemas 
        hacen que la empresa sea competitiva y pueda establecer una serie de estrat&eacute;gicas. 
        Como pueden ser las tareas de planificaci&oacute;n, seguimiento y control 
        de los objetivos.<br>
        <br>
        -Las tareas de planificaci&oacute;n: Tipos:</p>
      <p>-L&iacute;neas maestras de actuaci&oacute;n empresarial.<br>
        -selecci&oacute;n de objetivos.<br>
        -Definici&oacute;n de prioridades.<br>
        - Temporalizaci&oacute;n de las actuaciones.</p>
      <p>Como consecuencia de estas tareas se establecer&aacute;n los siguientes 
        criterios.</p>
      <p>1&ordm; Criterio de eficacia.<br>
        2&ordm; Criterio de productividad.<br>
        3&ordm; Criterio de rentabilidad.<br>
        4&ordm; Criterio de innovaci&oacute;n.<br>
        5&ordm; Criterio de implantaci&oacute;n.<br>
        6&ordm; Criterio de establecimiento de mercados. [T2D28]<br>
        <br>
        Un buen sistema exige claridad en los planteamientos y continuidad en 
        el tiempo. Si se realizan los dos puntos anteriores la empresa estar&aacute; 
        actualizada y como consecuencia de ello se podr&aacute; responder con 
        rapidez y tomar soluciones en consecuencia. Todos los datos que maneja 
        la empresa est&aacute;n almacenados en bases de datos bien como sistemas 
        de informaci&oacute;n de gesti&oacute;n o como sistemas de soporte a la 
        decisi&oacute;n. [T2D29]</p>
      <p>La gesti&oacute;n por medio de un sistema de informaci&oacute;n<br>
        La utilizaci&oacute;n de un sistema hace que aparezcan los modelos descriptivos. 
        Los modelos descriptivos permiten representar los hechos de la empresa. 
        Del estudio de los modelos descriptivos surgen los objetivos. La selecci&oacute;n 
        de los objetivos dar&aacute; lugar a las estrategias de la empresa. Si 
        la empresa es considerada como un sistema, la direcci&oacute;n de la empresa 
        ser&aacute; considerada como un subsistema, y como en todo sistema, estaremos 
        trabajando con tres elementos: </p>
      <p>Entrada ? Procesos ? Salidas</p>
      <h3> Tipos de sistemas de informaci&oacute;n </h3>
      <p>- Sistemas Ofim&aacute;ticos: <br>
        - Sistemas de proceso electr&oacute;nico de datos<br>
        - Sistemas de informaci&oacute;n para la gesti&oacute;n (MIS)<br>
        - Sistemas de soporte a la decisi&oacute;n (DSS)<br>
        - Sistemas expertos<br>
        - Sistemas inteligentes de soporte a la decisi&oacute;n.</p>
      <p>Sistemas Ofim&aacute;ticos: Son los m&aacute;s generalistas. Son utilizados 
        por todos los niveles de decisi&oacute;n dentro de la empresa. No est&aacute;n 
        especializados en ninguna tarea. Est&aacute;n basados en la tecnolog&iacute;a 
        de la informaci&oacute;n y de la comunicaci&oacute;n. Se clasifican en 
        dos tipos:<br>
        - Aquellos que les permiten establecer la comunicaci&oacute;n entre las 
        personas y los sistemas, utilizando la tecnolog&iacute;a de Internet (videoconferencia, 
        Chat, foros de decisi&oacute;n, e-mail)<br>
        - Los que permiten establecer la comunicaci&oacute;n entre personas de 
        la misma empresa y personas de distintas empresas, utilizando aplicaciones 
        como Word, Excel, Access, etc. [T2D30]</p>
      <p>Sistemas de proceso electr&oacute;nico de datos: Utilizan transacciones, 
        que son tareas muy estructuradas dentro de la empresa. Estas transacciones 
        pueden ser: de control de contabilidad, de facturaci&oacute;n, de balances, 
        de IVA, de cobros, de gesti&oacute;n de pedidos, etc. Los sistemas de 
        informaci&oacute;n que se encargan del proceso de transacciones son capaces 
        de gestionar grandes vol&uacute;menes de datos. El empleo del ordenador 
        frente al proceso manual permite conseguir los siguientes logros:<br>
        - Aumento de la velocidad<br>
        - Disminuci&oacute;n de los errores<br>
        - Aumento de la productividad<br>
        Fases en los proyectos de transacciones:<br>
        1. Selecci&oacute;n y almacenamiento de los datos. En esta fase hay que 
        definir cuidadosamente los formularios que son necesarios para la captura 
        de datos. <br>
        2. Revisi&oacute;n de la informaci&oacute;n almacenada y correcci&oacute;n 
        de errores.<br>
        3. Tratamiento o proceso de la informaci&oacute;n. En esta fase se realizan 
        las siguientes tareas:<br>
        a. Clasificaci&oacute;n: Con ella establecemos las prioridades en c&aacute;lculos, 
        listados y archivos.<br>
        b. Creaci&oacute;n de tablas con los datos procedentes de las transacciones.<br>
        c. Una vez que tengamos las tablas o ficheros, se almacena la informaci&oacute;n 
        de las transacciones.<br>
        d. Elaboraci&oacute;n de los informes que muestran el resultado del proceso 
        [T2D31] [T2D32]</p>
      <p>Sistemas de informaci&oacute;n para la gesti&oacute;n (MIS): Los MIS 
        est&aacute;n en el nivel t&aacute;ctico de la empresa. Van a permitir 
        establecer decisiones no rutinarias pero si esperadas, es decir, se repiten 
        con cierta periodicidad. El MIS permite la toma de decisiones, la informaci&oacute;n 
        disponible en el MIS permite la obtenci&oacute;n de nuevos datos a partir 
        de datos ya almacenados. Cuando en un sistema de proceso de transacciones 
        la informaci&oacute;n se almacena para emplearse posteriormente en la 
        toma de decisiones, comienza la aparici&oacute;n del MIS.</p>
      <p>Sistemas de soporte a la decisi&oacute;n (DSS): Un DSS se encarga de 
        facilitar a los directivos las decisiones no repetitivas o no estructuradas. 
        Los DSS no dan soluciones a problemas de niveles productivos.<br>
        Ventajas de los DSS: aportan soluciones inmediatas a problemas reales, 
        y disminuyen los tiempos de an&aacute;lisis.<br>
        Incrementan la competitividad porque solucionan problemas de forma m&aacute;s 
        r&aacute;pida y flexible.<br>
        Mejoran la planificaci&oacute;n y la toma de decisiones,<br>
        Uno de los programas que se utilizan para confeccionar los DSS es las 
        hojas de calculo (Excel). Los componentes de un DSS. Las bases de datos, 
        las bases de modelos, interfaces con el usuario y herramientas auxiliares.</p>
      <p>Sistemas expertos</p>
      <p>Aunque algunos fabricantes los incluyen dentro de los DSS, estos tienen 
        diferencias con los sistemas expertos.<br>
        <br>
        o Poseen cierta capacidad aut&oacute;noma para solucionar problemas. Al 
        sistema se le proporcionan unos datos y en funci&oacute;n de ellos toma 
        unas decisiones para alcanzar una soluci&oacute;n.<br>
        o En muchas ocasiones poseen un &uacute;nico modelo para alcanzar las 
        soluciones.<br>
        o Al emplear un modelo ya no es necesaria la instituci&oacute;n.<br>
        o Emplean reglas Heur&iacute;sticas, es decir, que permiten mejorar soluciones, 
        ya que realizan un estudio de todo lo que se ha realizado hasta el momento, 
        y en funci&oacute;n de ello se da la soluci&oacute;n.</p>
      <p>Sistemas inteligentes de soporte a la decisi&oacute;n</p>
      <p>Son la combinaci&oacute;n de los DSS y los sistemas expertos, al funcionar 
        integrados poseen cierta funcionalidad de Inteligencia Artificial.</p>
      <h3> La decisi&oacute;n en la empresa</h3>
        Definici&oacute;n de decisi&oacute;n: Es la selecci&oacute;n entre varias 
        opciones posibles. En todo proceso de decisi&oacute;n aparecen siempre 
        dos fases previas a la selecci&oacute;n: <br>
        - Recopilaci&oacute;n de informaci&oacute;n, es decir, definir el problema 
        indicando cu&aacute;les son los objetivos y fijar los criterios de evaluaci&oacute;n. 
        <br>
        - Creaci&oacute;n de soluciones alternativas.</p>
      <p>En la fase de selecci&oacute;n se elige una soluci&oacute;n entre las 
        posibles alternativas planteadas. En la fase de revisi&oacute;n se ejecuta 
        la decisi&oacute;n y se contrasta con lo esperado. La toma de decisiones 
        en la empresa puede ser de dos tipos:<br>
        - Estructurada: Se toma de forma rutinaria y repetitiva<br>
        - No estructurada: Se emplea para problemas no muy definidos, con caracter&iacute;sticas 
        variables de unos momentos a otros, y se resuelven con el buen hacer, 
        la intuici&oacute;n y el sentido com&uacute;n.<br>
        En una empresa hay tres niveles de decisi&oacute;n:</p>
      <p>ESTRAT&Eacute;GICO -&gt;T&Aacute;CTICO -&gt; OPERATIVO</p>
      <p>Nivel Operativo: En &eacute;l se realizan tareas rutinarias, repetitivas 
        y estructuradas. Estas tareas son realizadas por los encargados de producci&oacute;n<br>
        Nivel T&aacute;ctico: En &eacute;l se realizan tareas rutinarias con mayor 
        complejidad. Reciben informaci&oacute;n del nivel operativo y la transfieren 
        al estrat&eacute;gico. La realizan empleados con capacidad t&eacute;cnica, 
        y pueden ser oficiales, jefes de secci&oacute;n, jefes de departamento<br>
        Nivel Estrat&eacute;gico: En este nivel se toman las decisiones que afectan 
        a la marcha de la empresa. La informaci&oacute;n que utilizan puede estar 
        o no estructurada en la empresa. La toma de decisiones se basa en el sentido 
        com&uacute;n y en la intuici&oacute;n. Si el problema que se presenta 
        no es repetitivo, se desconoce la soluci&oacute;n.</p>
      <h3>Niveles de decisi&oacute;n, &aacute;reas funcionales y sistemas de 
        informaci&oacute;n:</h3>
        El sistema de informaci&oacute;n empresarial se divide en subsistemas 
        funcionales, que corresponden a los niveles de decisi&oacute;n [T2D33] 
        [T2D34]</p>
      <p> Nivel t&aacute;ctico (subsistema de gesti&oacute;n): En el se desarrollan 
        las gestiones que hacen que la producci&oacute;n sea &oacute;ptima. Las 
        personas que trabajan en este nivel tienen que proceder de la organizaci&oacute;n 
        y la gesti&oacute;n. Las bases de datos almacenar&aacute;n informaci&oacute;n 
        de las personas f&iacute;sicas, de las personas jur&iacute;dicas, de bienes 
        inmuebles, de libros y de empresas con un determinado perfil. [T2D35]<br>
        &Aacute;rea funcional financiera: [T2D36] Esta &aacute;rea funcional financiera 
        tiene los siguientes niveles:<br>
        - Operativo: En este nivel se realizan los asientos contables, es decir, 
        la actividad diaria de la empresa (ventas, facturaci&oacute;n, cobros, 
        pagos, impuestos, etc.). Tambi&eacute;n se realizan los libros contables. 
        La informaci&oacute;n de estos libros proviene de los asientos, y por 
        &uacute;ltimo, se dan las ordenes de compra-venta, que nos permiten realizar 
        un inventario y como consecuencia del mismo, modificar el catalogo de 
        los activos empresariales.<br>
        - T&aacute;ctico: En &eacute;l se elaboran los presupuestos. A partir 
        de los datos contables podemos saber el nivel de ingresos y gastos para 
        un determinado periodo. En este nivel tambi&eacute;n se realiza un control 
        de la tesorer&iacute;a, indicando donde se colocan los excedentes de tesorer&iacute;a, 
        saber cu&aacute;ndo hace falta liquidez, cu&aacute;l es la mejor financiaci&oacute;n 
        externa, etc.<br>
        - Estrat&eacute;gico: En este nivel se realiza un an&aacute;lisis financiero. 
        Para realizar este an&aacute;lisis, se utilizan bases de datos, hojas 
        de c&aacute;lculo, sistemas expertos o sistemas de decisi&oacute;n. Con 
        este an&aacute;lisis se crea la hip&oacute;tesis de trabajo con la que 
        vamos a dise&ntilde;ar el presupuesto. </p>
      <p>&Aacute;rea comercial y de marketing: Lo que la empresa ofrece es lo 
        que el cliente necesita. Los responsables de este &aacute;rea funcional 
        son los responsables de dar la primera impresi&oacute;n de la empresa 
        al os clientes su gesti&oacute;n tiene que ser muy eficaz para conseguir 
        un aumento de la demanda como consecuencia de un aumento del consumo de 
        los productos ofertados. Tiene los siguientes niveles:<br>
        - Operativo: este nivel los comerciales en la base de datos de los clientes 
        almacenaran visitas, pedidos realizados, nuevos contratos seguimientos, 
        control de calidad servicio preventa/posventa y con todo este tipo de 
        informaci&oacute;n se pueden extraer tres tipos de sistemas. El sistema 
        de ventas, distribuci&oacute;n y calidad.<br>
        - T&aacute;ctico: En este nivel se encuentra el sistema de an&aacute;lisis 
        de los datos referentes a precios. El sistema de informaci&oacute;n de 
        publicidad y de marketing. El an&aacute;lisis de gesti&oacute;n de las 
        ventas distribuci&oacute;n y calidad y la apertura de nuevos mercados.<br>
        - Estrat&eacute;gico: en este nivel se realizan los planes de marketing 
        a partir de los an&aacute;lisis anteriores.</p>
      <p>&Aacute;rea funcional de gesti&oacute;n de recursos humanos<br>
        Hay que conseguir que los intereses y objetivos de la empresa sean los 
        de los individuos, y para ello hay que motivar a las personas que trabajan 
        en la empresa. Niveles:<br>
        - Estrat&eacute;gico: bases de datos legislativos, es decir, los datos 
        referentes a leyes, impuestos, convenios colectivos, etc. Las bases de 
        datos personales, con datos familiares, de salario, profesionales, historial 
        m&eacute;dico. Sistemas de selecci&oacute;n de candidatos, el catalogo 
        de puertos de trabajo de la empresa son sus caracter&iacute;sticas. gesti&oacute;n 
        e nominas salariales con nominas y pagos de tributos.<br>
        - T&aacute;ctico: El estudio del contenido de las bases de datos permiten 
        elaborar planes de incentivos de productividad tambi&eacute;n permitir&aacute;n 
        evaluar las carencias formativas y las actualizaciones tecnol&oacute;gicas 
        dando facilidades para que los trabajadores realicen cursillos utilizando 
        simuladores para el aprendizaje. En este nivel se realizan las previsiones 
        tanto para el aumento de personal como para la disminuci&oacute;n.<br>
        - Nivel operativo o subsistema de producci&oacute;n: en este subsistema 
        se gestionan todas las bases del proceso productivo sigui&eacute;ndose 
        los siguientes pasos:</p>
      <p>[T2D36]<br>
        - Nivel operativo: en este nivel se realiza el control de producci&oacute;n 
        pedidos, facturaci&oacute;n, entregas, fabricaci&oacute;n y cobros. El 
        control de tasas horarias maquinas, hombres, departamentos, y trabajos 
        realizados. El control de almacenes stocks de materias primas y control 
        de pedidos tanto solicitados como definidos. Control de calidad de los 
        productos elaborados de las materias primas recibidas y de la calidad 
        de fabricaci&oacute;n.<br>
        - Nivel t&aacute;ctico: en este nivel se realizan los planes de producci&oacute;n. 
        Si los productos son ocasionales se har&aacute;n previsiones de acuerdo 
        a las fechas.<br>
        - Estrat&eacute;gico: se hace una planificaci&oacute;n de los recursos 
        tambi&eacute;n se realizara un estudio de los datos procedentes de la 
        competencia y se estudiar&aacute; la viabilidad de los nuevos I+D.<br>
        Nivel estrat&eacute;gico o subsitema de decisi&oacute;n<br>
        Se puede mostrar de dos modos diferentes como un sistema de direcci&oacute;n 
        o como un sistema de decisi&oacute;n. Ambas facetas pertenecen al sistema 
        estrat&eacute;gico.<br>
        El sistema de direcci&oacute;n: hace que las decisiones sean asumidas 
        por los niveles m&aacute;s bajos. Se consigue mediante el control del 
        sistema y los factores ambientales. Estos controles permiten que la empresa 
        se adapte al medio, que sea previsible y que se pueda programar.</p>
      <p> En el sistema de decisi&oacute;n se realizan tareas propias de la funci&oacute;n 
        directiva estas tareas son:<br>
        - Conocimiento del entorno empresarial con su evoluci&oacute;n hist&oacute;rica 
        y las tendencias a corto y medio plazo.<br>
        - Establecimiento de los objetivos de la organizaci&oacute;n indicando 
        las prioridades para poder alcanzar los fines.<br>
        - Con las asignaciones presupuestarias se establecen lo programas para 
        alcanzar los objetivos previstos.</p>
      <h3>Servicios inform&aacute;ticos en la empresa</h3>
        <br>
        Los suministros de 2 centros son CPD (centro de proceso de datos) y CC 
        (Centro de c&aacute;lculo). Los sistemas de informaci&oacute;n se pueden 
        definir para cada una de las &aacute;reas funcionales de la empresa, es 
        decir, producci&oacute;n, comercial, financiero y recursos humanos. Si 
        se integran todos estos sistemas de informaci&oacute;n se constituye el 
        sistema de informaci&oacute;n empresarial. El sistema de informaci&oacute;n 
        para el &aacute;rea financiera permite el estudio de las transacciones. 
        Para el &aacute;rea comercial satisface las necesidades del cliente analizando 
        los datos estad&iacute;sticos que se generan y as&iacute; estableciendo 
        la publicidad y el marketing. Para el &aacute;rea de producci&oacute;n 
        la informaci&oacute;n viene dada por la contabilidad donde se reflejan 
        compras, ventas, almacenes&#8230;. En el &aacute;rea de Recursos humanos 
        se facilita la informaci&oacute;n sobre las caracter&iacute;sticas de 
        los puestos de trabajo, de su nivel retributivo, hacienda, nominas, seguridad 
        social.</p>
      <h3> El centro de c&aacute;lculo</h3>
        Surge como consecuencia del crecimiento del departamento financiero o 
        de contabilidad al que se le asignan recursos inform&aacute;ticos para 
        la realizaci&oacute;n de tareas rutinarias de c&aacute;lculo. Si se comienza 
        a desarrollar programas para dar soluciones a diversos niveles funcionales 
        el centro de c&aacute;lculo se transforma en un centro de proceso de datos. 
        En el centro de proceso de datos se realizan tareas de an&aacute;lisis 
        de sistemas e ingenier&iacute;a de software y facilitan la informaci&oacute;n 
        de los recursos de software y hardware en los diferentes departamentos. 
        [T2D38]</p>
      <h3> Centro de proceso de datos</h3>
        <br>
        Dentro del organigrama de la empresa, puede ocupar distintas posiciones, 
        incluso situarse fuera de la empresa como si fuera una empresa de servicios.</p>
      <p>Estructura de un centro de proceso de datos: dependiendo de su configuraci&oacute;n 
        puede ser un sistema centralizado o descentralizado. Si es centralizado 
        posee una sede f&iacute;sica a la que se conectan los distintos departamentos 
        y las distintas redes como Internet este tipo de configuraci&oacute;n 
        edita la complicidad de tareas. Si la configuraci&oacute;n es descentralizada 
        el sistema tiene una mayor capacidad de respuesta al delegar responsabilidad 
        a los niveles intermedios. La implantaci&oacute;n de uno u otro sistema 
        depende de la filosof&iacute;a de la empresa. <br><br>
        Caracter&iacute;sticas de un centro de proceso de datos<br>
        La finalidad de un centro de proceso de datos es la de generar y mantener 
        el sistema de informaci&oacute;n obteniendo los objetivos que se ha propuesto 
        la empresa. Para ello realiza las siguientes tareas:<br>
        - tiene que ser responsable de los recursos tecnol&oacute;gicos existentes 
        tales como sistemas de informaci&oacute;n sistemas de producci&oacute;n, 
        control, de datos y el software y el hardware. Todos estos recursos aumentan 
        la competitividad en la empresa al aumentar la rapidez en le servicio.<br>
        - Si la implantaci&oacute;n en el sistema de informaci&oacute;n esta en 
        varios niveles el sistema estar&aacute; descentralizado y la responsabilidad 
        de los sistemas de informaci&oacute;n recaer&aacute; en los distintos 
        departamentos.<br>
        - El centro de proceso de datos como el resto de la empresa esta sujeto 
        a las siguientes labores: planificaci&oacute;n de presupuestos, control, 
        evaluaci&oacute;n de gastos, trabajo de los objetivos.</p>
      <p></p>
      <p><br>
        El centro de proceso de datos en la organizaci&oacute;n empresarial<br>
        Puede ser centralizado, como un departamento decicado a estas tareas, 
        o descentralizado, no existiendo departamento, estando distribuido entre 
        los distintos departamentos de la empresa, tanto los elementos inform&aacute;ticos 
        como el personal<br>
        - El Centro de proceso de datos cumple las funciones del Staff. En este 
        tipo de organizaci&oacute;n, el centro de proceso de datos es dependiente 
        de la direcci&oacute;n de la empresa. Al ser un departamento con funciones 
        de Staff, realiza las siguientes labores: Consultivas, de an&aacute;lisis 
        y distribuci&oacute;n de la informaci&oacute;n a los distintos departamentos. 
        [T2D40]<br>
        - Dependiendo del departamento de administraci&oacute;n: Este tipo de 
        organizaci&oacute;n surge como consecuencia de la mecanizaci&oacute;n 
        de las &aacute;reas financieras, primando los objetivos contables sobre 
        los de la empresa. [T2D41]<br>
        - Con un departamento m&aacute;s en la empresa. [T2D42]<br>
        - Como una empresa de servicios.[T2D43]<br>
        - Con estructura descentralizada: Cada departamento tiene su centro de 
        datos correspondiente. [T2D44]</p>
      <p><br>
        Tipos de centros de procesos de datos seg&uacute;n su estructura organizativa:</p>
      <p> [T2D45]<br>
        En este tipo hay tantos departamentos como fases en el desarrollo m&aacute;s 
        la direcci&oacute;n y el staff. Ventajas:<br>
        - Aprovechamiento de las estructuras existentes.<br>
        - Facilidad para la selecci&oacute;n.<br>
        - Formaci&oacute;n y mantenimiento de los puestos de trabajo del personal<br>
        Inconvenientes:<br>
        - No hay un responsable &uacute;ltimo de cada proyecto.<br>
        - Problemas de evaluaci&oacute;n y control.<br>
        - Problemas de relaci&oacute;n entre los distintos departamentos.</p>
      <p>Departamentos</p>
      <p> Direcci&oacute;n: La direcci&oacute;n de un centro de proceso de datos 
        del tipo funcional tiene que tener capacidades t&eacute;cnicas en inform&aacute;ticas 
        ya que a su cargo va a estar el hardware el software y el personal.<br>
        Staff: en el se realizan tareas de apoyo y direccionamiento a la direcci&oacute;n.<br>
        An&aacute;lisis y Sistemas: La direcci&oacute;n plantea el problema a 
        resolver y en estos departamentos se realizan los estudios de fiabilidad.<br>
        Programaci&oacute;n: En el se realizan los programas los juegos de pruebas 
        y se entrega lo realizado la equipo de explotaci&oacute;n.<br>
        Explotaci&oacute;n: Se encarga de la puesta en marcha de la aplicaci&oacute;n.<br>
        Mantenimiento de sistemas: son los encargados de dar soluci&oacute;n a 
        los problemas que aparecen durante el funcionamiento del sistema.</p>
      <p>Por proyectos<br>
        [T2D46]</p>
      <p> Ventajas:<br>
        - la existencia de un responsable por cada proyecto.<br>
        - Como consecuencia del anterior las decisiones se toman con rapidez.<br>
        Desventajas:<br>
        - la formaci&oacute;n previa a cada proyecto.<br>
        - La tendencia a perpetuarse los proyectos es el tiempo.</p>
      <p><br>
        El matricial<br>
        [T2D47]<br>
        Ventajas<br>
        - Este trabajo en equipo exige una metodolog&iacute;a dando mayor eficacia 
        al sistema.<br>
        - Cada persona que interviene en el proyecto tiene una porci&oacute;n 
        de responsabilidad.<br>
        Inconvenientes:<br>
        - Cada persona puede tener uno o m&aacute;s responsables por encima de 
        &eacute;l.<br>
        - Excesiva documentaci&oacute;n del proyecto.</p>
      <p>Equipos democr&aacute;ticos de proyectos<br>
        El liderazgo ronda a trav&eacute;s de los distintos proyectos. Las decisiones 
        son tomadas por consenso. Los equipos son participativos. La satisfacci&oacute;n 
        por el trabajo es alta, lo que se transforma en una mayor calidad de proyecto.<br>
        [T2D48]</p>
      <p>Equipos con jefe de programaci&oacute;n<br>
        Permiten un desarrollo r&aacute;pido y eficaz de las aplicaciones. Una 
        vez marcadas las l&iacute;neas maestras del trabajo a realizar.</p>
      <p>Equipos jer&aacute;rquicos de proyectos<br>
        Son los m&aacute;s eficaces en proyectos de larga duraci&oacute;n, ya 
        que hay un &uacute;nico responsable. No son eficaces para peque&ntilde;os 
        proyectos. Est&aacute;n formados por varios equipos con un jefe de proyecto. 
        Est&aacute;n formados por varios equipos y un jefe de proyecto, del que 
        dependen los jefes de programaci&oacute;n</p>
      <h3>Funciones caracter&iacute;sticas de un centro de proceso de datos</h3>
        - Desarrollo de sistemas inform&aacute;ticos: Presenta las siguientes 
        fases:<br>
        - An&aacute;lisis<br>
        - Desarrollo<br>
        - Codificaci&oacute;n<br>
        - Pruebas<br>
        - Implantaci&oacute;n<br>
        - Mantenimiento<br>
        - Explotaci&oacute;n: Presenta las siguientes fases:<br>
        - Previsi&oacute;n de fechas de las tareas a realizar<br>
        - Operativa general del sistema<br>
        - Control de dispositivos de almacenamiento<br>
        - Seguridad del sistema.<br>
        - Supervisi&oacute;n del trabajo<br>
        - Soporte t&eacute;cnico: Dado tanto a los usuarios como al mantenimiento 
        del sistema, presenta las siguientes fases:<br>
        - Seleccionar y gestionar el mantenimiento del Sistema Operativo<br>
        - Dise&ntilde;ar las estructuras de las bases de datos m&aacute;s adecuadas<br>
        - Gestionar los equipos de teleproceso<br>
        - Estudio y evaluaci&oacute;n de las necesidades y rendimientos del sistema.<br>
        - Formaci&oacute;n y apoyo a los usuarios<br>
        - Gesti&oacute;n y administraci&oacute;n: Se encuentra en los distintos 
        niveles funcionales, y presenta las siguientes fases:<br>
        - Supervisi&oacute;n, planificaci&oacute;n, y control de los proyectos.<br>
        - Seguridad de los recursos f&iacute;sicos y l&oacute;gicos<br>
        - Gesti&oacute;n financiera<br>
        - Gesti&oacute;n personal<br>
      </p>
      <p>&nbsp; </p>
      <p><br>
      </p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
