<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Introduccion al desarrollo de aplicaciones informaticas</title>
<META http-equiv=Content-Language content=es>
<META content="Introduccion al desarrollo de aplicaciones informaticas" name=description>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="keywords" content="Introduccion al desarrollo de aplicaciones informaticas">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos">

  <tr> 
    <td height="39" colspan="3"> <h2> An&aacute;lisis de Requisitos</h2></td>
  </tr>
  <tr> 
    <td height="258" colspan="3"> <h3>Fases de an&aacute;lisis del sistema </h3>
	  <p> El an&aacute;lisis de requisitos del sistema es igual que la fase de 
        an&aacute;lisis en un sistema en m&eacute;trica en esta fase lo que se 
        realiza es definir los objetivos, es decir, que productos pretendemos 
        obtener y definir que t&eacute;cnicas vamos a emplear para obtener estos 
        productos.<br>
      </p>
      <p></p>
      <p>Dentro de la metodolog&iacute;a de desarrollo el an&aacute;lisis del 
        sistema es la primera fase. En ella el analista m&aacute;s el cliente 
        indicar&aacute; las especificaciones es decir las necesidades de informaci&oacute;n 
        y la arquitectura del sistema a desarrollar. Con el an&aacute;lisis de 
        requisitos y las especificaciones funcionales tendremos informaci&oacute;n 
        de los siguientes elementos:<br>
        1- Funcionalidad.<br>
        2- Restricciones.<br>
        3- Relaciones.<br>
        4- Costes.<br>
        5- Recursos.<br>
        6- Empleados.<br>
        7- Riesgos.<br>
        8- Tiempos para las diferentes tareas.<br>
        9- Personal que interviene en cada una de las fases.<br>
        10- Con todas estas informaciones tendremos una visi&oacute;n tanto del 
        entorno f&iacute;sico como del tecnol&oacute;gico.</p>
      <p> </p>
      <p></p>
      <p><br>
        Objetivos<br>
        Los objetivos que se tienen que cumplir dentro de la fase de an&aacute;lisis 
        nos van a venir dados por las siguientes necesidades:<br>
        1- las necesidades del cliente.<br>
        - Reuniones para saber las necesidades del cliente se realizaran reuniones 
        y entrevistas entre los miembros del equipo de an&aacute;lisis el cliente 
        y los usuarios finales.<br>
        - Restricciones econ&oacute;micas en temporales que va a dar el cliente.<br>
        - Productos existentes en el mercado.<br>
        Con estos tres elementos se realiza un documento conceptual del sistema 
        este documento se ira modificando a medida que se obtienen los requisitos 
        del sistema. Seg&uacute;n la necesidad de realizar un estudio de viabilidad 
        econ&oacute;mica, t&eacute;cnica y legal.</p>
      <p>Limitaciones econ&oacute;micas temporales: se tendr&aacute; que contestar 
        a las siguientes preguntas:<br>
        1- &iquest;se terminar&aacute; el proyecto a tiempo?<br>
        2- &iquest;Se terminar&aacute; el proyecto con el dinero disponible?<br>
        3- &iquest;Con el personal disponible?<br>
        4- &iquest;Con las herramientas disponibles?<br>
        5- &iquest;Con las t&eacute;cnicas disponibles?</p>
      <p>Viabilidad legal<br>
        Se estudiar&aacute;<br>
        1- los elementos jur&iacute;dicos relacionados con las actividades inform&aacute;ticas.<br>
        2- protecci&oacute;n de datos.<br>
        3- obligaciones definidas en los contratos.<br>
        4- responsabilidades legales.</p>
      <p>Con estos dos elementos las limitaciones econ&oacute;mico temporales 
        y la viabilidad legal se realizara un documento que la direcci&oacute;n 
        del proyecto revisara para valorar la continuidad o el abandono del mismo.<br>
        <h3>Modelo de an&aacute;lisis de requisitos del sistema</h3>
        Los objetivos de este modelo son:<br>
        1- Analizar y documentar las necesidades funcionales del nuevo sistema 
        si se ha realizado la fase 0 tendremos ya un catalogo de requisitos.<br>
        2- Identificar los requisitos y las necesidades de este nuevo sistema.<br>
        3- Estudiar las distintas alternativas, es decir, que se quiere obtener 
        y cuanto nos va a costar.<h3>
        &Aacute;mbito y alcance del proyecto</h3>
        
      <p>Se realizar&aacute; un estudio de los objetivos &aacute;mbitos y restricciones 
        y para llevarlo a cabo se llevaran las siguientes tareas.<br>
        Tarea 1: definici&oacute;n del proyecto<br>
        Objetivos<br>
        Entre los objetivos que va a realizar ser&aacute;n los siguientes:<br>
        1- realizar una descripci&oacute;n del proyecto tanto de los objetivos 
        como de las restricciones.<br>
        2- Identificar grupos &aacute;reas y departamentos implicados.<br>
        3- Duraci&oacute;n del proyecto para ello se realizaran graficas.<br>
        4- Que equipo de trabajo va a realizar el proyecto.<br>
        Que producto se va a obtener<br>
        En este apartado se har&aacute; una descripci&oacute;n general del proyecto 
        y se definir&aacute;n los objetivos principales departamentos, planificaci&oacute;n 
        de equipos, restricciones la composici&oacute;n del equipo de trabajo.<br>
        T&eacute;cnicas a emplear: Se van a emplear dos t&eacute;cnicas entrevistas 
        y cuestionarios.<br>
        Entrevistas: en una entrevista lo primero que se realizara ser&aacute; 
        una lectura de antecedentes hay que conocer todo lo referente a la empresa 
        tenemos que obtener datos objetivos y para ello recurrimos a fuentes externas. 
        Segundo establecer los objetivos los objetivos a conseguir con la entrevista 
        deben de estar fijados de antemano. Tenemos que conocer de antemano con 
        quien nos estamos entrevistando para saber que preguntas tenemos que realizar. 
        Tercero selecci&oacute;n de los entrevistados se empezar&aacute; por los 
        directivos hasta llegar por los empleados o sue&ntilde;os finales. Los 
        directivos nos indicaran a que personas debemos entrevistar. Cuarto preparaci&oacute;n 
        del entrevistado al entrevistado se le indicara la fecha y la hora con 
        antelaci&oacute;n unos d&iacute;as antes se le recordara que se le va 
        ha hacer una entrevista y se le proporcionara un cuestionario con las 
        materias a tratar. Las respuestas que nos proporciona el entrevistado 
        tienen que ser objetivas y con todas las respuestas que nos den realizaremos 
        un resumen y agradeceremos la atenci&oacute;n que nos han prestado. Selecci&oacute;n 
        del tipo de preguntas pueden ser de dos tipos abiertas y cerradas:<br>
        - abiertas se realizan preguntas abiertas en todas aquellas que sean de 
        car&aacute;cter general para establecer unas relaciones de cordialidad 
        entre el entrevistador y el entrevistado.<br>
        - Cerradas: ser&aacute;n relativas a los aspectos funcionales del sistema.<br>
        Sexto: como se realizaran las preguntas. Se van a utilizar tres m&eacute;todos 
        el inductivo, el deductivo y una mezcla de ambos.<br>
        &#8226; inductivo: mezclando preguntas abiertas y cerradas.<br>
        &#8226; Deductivos: de preguntas generales se va concretando cada vez 
        m&aacute;s para los datos que nos interesan para nuestro proyecto.<br>
        Cuestionarios: <br>
        Se realizan cuando no se pueden realizar entrevistas. Las preguntas que 
        vamos a realizar puede ser de respuesta abierta o cerrada pueden ser de 
        si o no o puntuales, poniendo una escala del 1 al 10. Tambi&eacute;n pueden 
        ser estimabas poniendo bueno, muy bueno, regular, etc. Las respuestas 
        que son valorables tienen el inconveniente de introducir elementos subjetivos.</p> 
      </p>
      <p>Tarea 2: identificaci&oacute;n de los usuarios participantes<br>
        Objetivos: </p>
      <p>1. Se identificar&aacute; a los responsables de cada &aacute;rea implicada 
        para ello se realizaran descripciones de cada unidad de representante 
        de usuario del &aacute;rea t&eacute;cnica de los controles de calidad, 
        etc.<br>
        2. Identificar a los principales usuarios implicados. Para ello tendremos 
        que tener en cuenta las funciones que se van a automatizar las repercusiones 
        de los nuevos sistemas usuarios y las implicaciones legales del nuevo 
        sistema.<br>
        3. Conseguir datos de los participantes. De los participantes se ha de 
        tener los siguientes datos: 1.<br>
        i. nombre.<br>
        ii. Apellidos.<br>
        iii. Organizaci&oacute;n a la que pertenece.<br>
        iv. Tel&eacute;fono de contacto.<br>
        v. Disponibilidad horaria.<br>
        vi. Localizaci&oacute;n de su puesto de trabajo</p>
      <p> Producto a obtener: Para ello disponemos de una lista o fichero en el 
        que estar&aacute;n los usuarios participantes responsables y el personal 
        T&eacute;cnico de las &aacute;reas afectadas.<br>
        T&eacute;cnicas a emplear: ser&aacute;n entrevistas o reuniones. Y se 
        har&aacute;n con el jefe de personal y con responsables de distintas &aacute;reas.<br>
        Ficheros de datos de los participantes: para formar a los participantes 
        ser&aacute; necesario disponer de una tabla en la que aparezca toda la 
        informaci&oacute;n de los mismos. Los datos a incluir en esta tabla ser&aacute;n:</p>
      <p>4. Nombre y apellidos.<br>
        5. Lugar de trabajo.<br>
        6. Provincia.<br>
        7. Poblaci&oacute;n.<br>
        8. Direcci&oacute;n.<br>
        9. Planta.<br>
        10. Despacho, tel&eacute;fono de contacto con extensi&oacute;n fax y correo 
        electr&oacute;nico.<br>
        11. Disponibilidad horaria.<br>
        12. &Aacute;rea funcional en la que trabaja departamento secci&oacute;n 
        y cargo que ocupa en la organizaci&oacute;n.<br>
        13. Identificaci&oacute;n del superior jer&aacute;rquico.<br>
        14. Tareas que desempe&ntilde;a en la organizaci&oacute;n.<br>
        15. Nivel de implicaci&oacute;n en el proyecto.<br>
        16. Tareas que desempe&ntilde;a en el proyecto.<br>
        17. Informaci&oacute;n que puede aportar al proyecto<br>
        18. Junto con esta tabla se har&aacute; una tabla de seguimiento y en 
        ella ir&aacute;n los datos de altas las reuniones, las entrevistas y los 
        correos electr&oacute;nicos enviados.</p>
      <p>Organigramas<br>
        Sera necesario tener un organigrama del participante este organigrama 
        sera jerarquico empezando por el jefe del proyecto siguiendo por los responsables 
        de &aacute;reas hasta llegar a la parte inferior donde se encuentran los 
        usuarios finales. Cada una de las personas que aparecen en el organigrama 
        apareceran sus datos recogidos en los ficheros.<br>
      </p>
      <p><img src="../../imagenes/analisis/tema3/image003.gif" width="565" height="157"> 
      </p>
      <p></p>
      <p>Reuniones</p>
      <p>Los requisitos del sistema apareceran a trav&eacute;s de las distintas 
        reuniones. El trabajo de las reuniones se realizara en equipo estableciendose 
        las diferencias entre el equiopo personal de la empresa y el equipo de 
        analisis. Antes de realizar la primera reunio se especificaran las especificaciones 
        del sistema y el producto que se va a desarrollar. El lugar donde se realizaran 
        las reuniones sera la empresa del cliente en una zona neutral o en nuestra 
        propia empresa. Al comenzar la primera reunion todos los participantes 
        tienen que conocer las normas de participaci&oacute;n y de preparaci&oacute;n 
        del trabajo. Para cada sesion de trabajo cada participante tiene que tener 
        un guion que se le habre hecho llevar con antelaci&oacute;n y el participante 
        llevara a la reunion varias listas de trabajo.</p>
      <p> Listas de trabajo<br>
        con los elementos u objetivos que forman parte del sistema obtendremos 
        las listas de clientres proveedore y contabilidad los objetivos que va 
        a producir el sistema seran ficheros de datos listados, diagramas y graficos. 
        Los procesos o funciones que manipulan los objetos son procesos que interactuan 
        con los datos o la descomposici&oacute;n de los procesos en otros m&aacute;s 
        elementales hasta llevar a los m&aacute;s sencillos.<br>
        - Listas de restricciones: en ellas tendremos:<br>
        o Criterios de validaci&oacute;n: en ellos se indicaran los valores permitidos 
        y los modelos de indicacion de los datos.<br>
        o Restricciones de los procesos: para ello utilizaremos tablas de decisi&oacute;n 
        para la eleccion de unas rutinas u otras y tablas de decisi&oacute;n para 
        la elecci&oacute;n de unos procesos u otros.<br>
        o Restricciones generales: en este apartado se veran los criterios de 
        rendimiento del sistema, es decir, los tiempos de respuesta los equipos 
        sobre los que se va a implantar, la memoria que se va a utilizar, etc.<br>
        o Restricciones de coste:<br>
        o Restricciones de coste de desarrollo: Para cada una de las l&iacute;neas 
        de las tablas se realizan unas especificaciones m&aacute;s detalladas 
        que se denominan mini especificaciones y con todos estos elementos se 
        intenta resolver el problema.</p>
      <h3> Identificar y definir requisitos</h3>
      </p>
      <img src="../../imagenes/analisis/tema3/image004.gif" width="553" height="122"> 
      <p>Planificaci&oacute;n de entrevistas, En cuanto a los objetivos<br>
      </p>
      <p><br>
        <img src="../../imagenes/analisis/tema3/image005.gif" width="518" height="325"> 
      </p>
      <p><img src="../../imagenes/analisis/tema3/image006.gif" width="553" height="194"> 
      </p>
      <p><img src="../../imagenes/analisis/tema3/image007.gif" width="457" height="216"> 
      </p>
      <p><img src="../../imagenes/analisis/tema3/image008.gif" width="517" height="96"> 
      </p>
      <p>En cuanto a la especificaci&oacute;n de requisitos. Los requisitos pueden 
        ser de dos tipos:</p>
      <p>- Funcionales: son aquellos que describen el comportamiento esperado 
        del sistema.<br>
        - No funcionales: son aquellos que describen las propiedades e indican 
        las restricciones, es decir, las limitaciones a las distintas posibilidades 
        de trabajar los requisitos de funcionamiento indican las especificaciones 
        de dise&ntilde;o tambi&eacute;n indican el tiempo de respuesta y ocupaci&oacute;n 
        de la memoria.<br>
        o Manejo de excepciones: todo lo que tiene que ver con el comportamiento 
        no deseado del sistema.<br>
        Caracter&iacute;sticas que se esperan de una especificaci&oacute;n:</p>
      <p>- Completa: Hay que documentar todos los requisitos.<br>
        - Consistente: No puede haber requisitos contradictorios.<br>
        - Concisa: Tiene que escribirse con frases breves y f&aacute;ciles de 
        entender.<br>
        - No tiene que ser ambiguo, es decir no puede haber diferentes formas 
        de entender una especificaci&oacute;n.<br>
        - Verificable: Tiene que estar comprobada por el cliente para ver si es 
        correcta.<br>
        <br>
        Los principales defectos que aparecen en el manual de especificaci&oacute;n:</p>
      <p>- Trivialidades: Es decir, todo lo que sea obvio no hay que indicarlo.<br>
        - Ambig&uuml;edades: no se pueden utilizar frases que tengan m&aacute;s 
        de un sentido.<br>
        - Omisiones: Hay que planear adecuadamente las entrevistas.<br>
        - Directrices de dise&ntilde;o e implantaci&oacute;n.</p>
      <p> Cat&aacute;logo de requisitos<br>
        Cuando se han definido todos los requisitos se elabora un catalogo separando 
        los funcionales de los no funcionales, se estructuran y se pasa de los 
        m&aacute;s abstractos a los m&aacute;s concretos el cat&aacute;logo nos 
        aporta la informaci&oacute;n necesaria para el desarrollo adecuado del 
        sistema. Dentro de los requisitos funcionales se nos informar&aacute;.</p>
      <p>- Si se tiene que imprimir un albar&aacute;n y las copias que se tienen 
        que realizar.<br>
        - El d&iacute;a que la administraci&oacute;n exige un listado de los pedidos 
        pendientes.<br>
        - Listado de los pedidos pendientes junto con etiquetas.<br>
        - Env&iacute;o del listado a distribuci&oacute;n y de las etiquetas a 
        fabricaci&oacute;n.<br>
        <br>
        Algunos de los requisitos no funcionales:<br>
        - la fecha de nacimiento no puede ser mayor que la fecha actual menos 
        16 a&ntilde;os.<br>
        - Cualquier salario tiene que estar comprendido entre 150.000 y 300.000 
        pesetas.<br>
        - Especificaci&oacute;n de hardware: se pretende aprovechar y Pentium 
        200.<br>
        - Software: se pretende utilizar W98.<br>
        - Referente al sistema: cualquier producto software que se utilice tiene 
        que ser de Microsoft&reg;.<br>
        - Cuando se produce un error se termine el programa.</p>
      <p> T&eacute;cnicas<br>
        Realizaci&oacute;n de entrevistas con los responsables y con los usuarios 
        tanto de las &aacute;reas funcionales como de los departamentos implicados.</p>
      <p> Tarea 2- identificaci&oacute;n de problemas y necesidades<br>
        Objetivos</p>
      <p>&#8226; representar gr&aacute;ficamente el funcionamiento actual del 
        sistema.<br>
        &#8226; Identificar los grupos de informaci&oacute;n y las tareas que 
        realizan.<br>
        &#8226; Identificar las entradas, salidas, almacenamiento de informaci&oacute;n 
        y la comunicaci&oacute;n con otras unidades.<br>
        &#8226; Identificar los objetivos que debe cumplir el otro sistema.<br>
        &#8226; Identificar los archivos y documentos que se dan fuentes de informaci&oacute;n.<br>
        &#8226; Estimar los costes de la explotaci&oacute;n actual, tiempos de 
        ordenador/usuario, mantenimiento de programas, mejora de programas, etc.<br>
        &#8226; Evaluar la informaci&oacute;n producida por el sistema actual 
        para detectar nuevos requisitos que deban satisfacer al nuevo sistema.</p>
      <p> El Producto<br>
        <br>
        El producto que se obtiene es un modelo f&iacute;sico del modelo actual. 
        En este modelo se incluye una lista de las necesidades del sistema actual 
        junto con el catalogo de requisitos y otras prioridades</p>
      <p> La t&eacute;cnica<br>
        La t&eacute;cnica necesaria para realizar entrevistas a los usuarios y 
        al personal t&eacute;cnico.</p>
      <h3>Dise&ntilde;o del modelo l&oacute;gico actual</h3>
      <p> Se representa gr&aacute;ficamente el modelo l&oacute;gico actual tanto 
        para los datos como para los procesos dibujando:</p>
      <p>- Los subesquemas que lo componen.<br>
        - Los flujos de informaci&oacute;n.<br>
        - Entidades.<br>
        - La relaciones entre las entidades.<br>
        - De esta manera se pretende conocer el sistema actual desde el punto 
        de vista del funcionamiento.<br>
        Diccionario de datos</p>
      <p> se trata de una tabla que se emplea para describir el contenido de los 
        objetivos definidos durante el an&aacute;lisis en este diccionario se 
        incluyen datos necesarios para el sistema como entradas, salidas, datos 
        intermedios y c&aacute;lculos. Tambi&eacute;n se posee informaci&oacute;n 
        a cerca de cada uno de los elementos del sistema conociendo su nombre 
        sin&oacute;nimos, procesos que utiliza ese elemento, como se utiliza ese 
        elemento en E/S e, en c&aacute;lculos, descripci&oacute;n del contenido, 
        valores permitidos, tipo de datos, valor por defecto y cualquier otra 
        informaci&oacute;n significativa.<br>
      </p>
      <p>Tarea1: Dise&ntilde;ar el modelo l&oacute;gico actual de procesos.</p>
      <p><br>
        1.1 Objetivos.</p>
      <p>Para construir el modelo l&oacute;gico actual de procesos se tienen que 
        tener en cuenta los siguientes puntos:</p>
      <p>- Que no se hace referencia al entorno f&iacute;sico.<br>
        - Que estudia las funciones que realizan, pero no como lo realizan.<br>
        - Determinar las funciones del sistema que ser&aacute;n subsistemas.<br>
        - Identificar las entradas salidas as&iacute; como los flujos de informaci&oacute;n 
        del sistema.<br>
        - Identificar las entidades de datos.<br>
        - Si fuese necesario descomponer los subsistemas, identificando las entradas/salidas.<br>
        - Verificar el modelo l&oacute;gico de procesos correcto.<br>
        - Identificar los nuevos requisitos.</p>
      <p>1.2 Productos.</p>
      <p>Es lo que vamos a obtener con el modelo l&oacute;gico actual de procesos.</p>
      <p> Mod Diagrama Subsis.1<br>
        Log Art Flujo de subsis.2<br>
        Procesos Datos --------------<br>
        Subsis &#8220;n&#8221;<br>
        Catalogo de requisitos<br>
        - Prioridades<br>
        1.3 T&eacute;cnicas.</p>
      <p>Las t&eacute;cnicas que se van a realizar son la realizaci&oacute;n de 
        entrevistas y como consecuencia de ellas se realizaran los diagramas de 
        flujos de datos.</p>
      <p></p>
      <p>ESPECIFICACION DE PROCESOS.</p>
      <p>1. Diagramas de flujos de datos: estos diagramas solo representan el 
        movimiento de los datos. Son una t&eacute;cnica grafica. Se utilizan sobre 
        el an&aacute;lisis de requisitos. Sirven para representar las funciones, 
        es decir, intervienen en la transformaci&oacute;n de datos y transforman 
        los datos a medida que se avanza en el sistema.</p>
      <p><br>
        Entradas salidas</p>
      <p> Movimiento de datos</p>
      <p>a. Niveles de representaci&oacute;n: estos diagramas representan un sistema 
        a cualquier nivel de astricci&oacute;n. Los niveles de astricci&oacute;n 
        o refinamiento permiten representar un mayor flujo de la informaci&oacute;n 
        y mayor detalle funcional. Se suelen emplear hasta tres niveles. Es raro 
        emplear niveles superiores a este y van numerados de 0 a N.</p>
      <p>- Nivel 0: se conoce con el nombre de diagramas de contexto. Representan 
        el flujo total de datos del sistema. La expansi&oacute;n de estos da origen 
        a los diagramas de flujo de datos de Nivel 1 o diagramas de subsistemas.<br>
        - Nivel 1 y posteriores: un diagrama de datos de nivel 1 posee varios 
        procesos conectados entre si mediante flechas. Cada proceso representa 
        un subsistema y se crean niveles inferiores para obtener un mayor detalle.</p>
      <p>b. Elementos de un diagrama de flujo: </p>
      <p>- Entidades externas: se representan mediante un c&iacute;rculo o una 
        elipse. Con el nombre en su interior, este nombre no puede ser un verbo. 
        Son el origen y el destino de los datos. Producen informaci&oacute;n o 
        la consumen. Son elementos externos al sistema. Pueden ser personas, Hardware 
        o Software. No se pueden comunicar entre si, ya que el flujo de datos 
        queda fuera del sistema, tampoco pueden relacionarse con un almac&eacute;n 
        de datos si no existe un proceso por medio. Se pueden repetir varias veces 
        las entidades externas para que no existan entrecruzamientos. Pueden aparecer 
        en cualquier nivel.</p>
      <p>- Procesos: representan actividades que transforman la informaci&oacute;n. 
        No hay correspondencia entre procesos y programas. Un proceso suele expandirse 
        en m&uacute;ltiples programas, m&uacute;ltiples funciones o m&uacute;ltiples 
        rutinas. Solo se representan los procesos contenidos en el sistema a modelar. 
        Se les asigna como nombre o etiqueta un verbo que define la acci&oacute;n 
        a realizar. Cada proceso tiene un flujo de datos de entrada y un flujo 
        de datos de salida. No pueden ser ni origen ni destino. Se pueden conectar 
        dos procesos entre si. La explosi&oacute;n o refinado de los procesos 
        se realiza de uno en uno. Cuando explosionan procesos se detectan nuevos 
        verbos y estos verbos significan nuevos procesos. Se llega hasta procesos 
        primitivos, es decir, que no se pueden expandir m&aacute;s. En cada proceso 
        primitivo se ponen sus caracter&iacute;sticas y esto se llama mini especificaciones. 
        Las especificaciones se representan utilizando distintas t&eacute;cnicas.</p>
      <p>Narrativa.<br>
        Ecuaciones matem&aacute;ticas.<br>
        Tablas.<br>
        Diagramas.<br>
        Gr&aacute;ficos.<br>
        Descripciones en seudo c&oacute;digos (lenguaje de descripci&oacute;n 
        de programas).</p>
      <p>Estas caracter&iacute;sticas sirven para crear los requisitos del software 
        y para dise&ntilde;ar el programa que realizara el proceso.</p>
      <p><img src="../../imagenes/analisis/tema3/image001-.gif" width="301" height="109"></p>
      <p></p>
      <p><br>
        - almac&eacute;n de datos: sirven para el almacenamiento permanente o 
        temporal de los datos. Pueden ser utilizados por procesos diferentes a 
        los que los crean. Pueden ser utilizados por uno o m&aacute;s procesos. 
        Tienen un flujo de datos de entrada y de salida. No puede haber comunicaci&oacute;n 
        entre almacenes de datos y entidades externas. Los almacenes de datos 
        ni crean ni destruyen datos. Sobre ellos se realizan las operaciones de 
        lectura, escritura y actualizaci&oacute;n. Solo aparecen en los diagramas 
        de flujo que son utilizados, no aparecen en los diagramas de contexto.</p>
      <p><br>
        <img src="../../imagenes/analisis/tema3/image002-.gif" width="469" height="25"> 
        <br>
        <br>
        - Flujos de datos: sirven para representar los movimientos de los datos. 
        Se representan mediante flechas.</p>
      <p></p>
      <p>La punta de las flechas indica la direcci&oacute;n de los datos. Cada 
        flecha posee un nombre o etiqueta que puede estar formada por un sustantivo 
        y el participio del verbo del proceso que proviene.</p>
      <p>Ejemplo: Un centro educativo desea crear un sistema de informaci&oacute;n 
        que gestione las ausencias o retrasos a clase. Cada profesor pasa lista 
        despu&eacute;s de llegar a clase y escribe un parte de ausencias o retrasos 
        por cada alumno que no este en el aula. Los datos del parte se introducen 
        en el ordenador y despu&eacute;s de las comprobaciones oportunas se env&iacute;a 
        al jefe de estudios un informe de las faltas diarias de los alumnos.<br>
      </p>
      <p>&nbsp; </p>
      <p>&nbsp; </p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
