<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>JavaServer Faces</title>
<META http-equiv=Content-Language content=es>
<META content="Manual JSP, ejemplos JSP, codigos JSP" name=description>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="keywords" content="Manual JSP, ejemplos JSP, codigos JSP">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos">
  <tr> 
    <td height="39" colspan="3"> <h2> Introducci&oacute;n</h2></td>
  </tr>
    
  <tr> 
    <td height="39" colspan="3">
<p>JavaServer Faces (JSF) es un framework est&aacute;ndar Java que permite construir 
        aplicaciones Web. Se define por las especificaciones JSR 127, JSR 252 
        y JSR 276 e implementa el patr&oacute;n Modelo-Vista-Controlador (MVC).<br>
        Dicho modelo MVC es un patr&oacute;n de arquitectura de desarrollo software 
        que separa las aplicaciones en tres capas diferenciadas: datos (Modelo), 
        interfaz de usuario (Vista) y l&oacute;gica de control (Controlador). 
        Esto permite una separaci&oacute;n entre la interfaz de usuario y la l&oacute;gica 
        que hace que el mantenimiento de las aplicaciones JSF sea sencillo.<br>
        JSF es un conjunto de componentes de usuario (UI) que permite construir 
        la capa de vista de las aplicaciones Web. As&iacute;, proporciona un conjunto 
        de APIs para desarrollar estos componentes UI y gestionar su funcionamiento 
        mediante el tratamiento de eventos, la validaciones de entrada, la definici&oacute;n 
        de la navegaci&oacute;n entre p&aacute;ginas y el soporte de accesibilidad.<br>
        Asimismo, JSF trata el interfaz de usuario (Vista) de una forma parecida 
        al estilo de Swing o Visual Basic, realizando su programaci&oacute;n a 
        trav&eacute;s de componentes y basada en eventos.<br>
        Adem&aacute;s, las clases de componentes UI incluidas en JSF encapsulan 
        su funcionalidad y no la presentaci&oacute;n en un tipo de cliente espec&iacute;fico 
        por lo que esto permite poder ser pintados en distintos clientes.<br>
        Por otro lado, JSF permite tambi&eacute;n la creaci&oacute;n de nuestros 
        propios componentes UI personalizados a partir de la extensi&oacute;n 
        de los ya existentes e incluye la propiedad de &#8220;render&#8221; para 
        pintarlos seg&uacute;n nos convenga.</p>
      <p>Adem&aacute;s, la tecnolog&iacute;a JSF ha sido dise&ntilde;ada para 
        ser flexible al contrario que otras tecnolog&iacute;as actuales que exigen 
        la utilizaci&oacute;n de lenguajes de marcadores, protocolos o el uso 
        de determinados clientes.<br>
        Por todo esto, JSF es f&aacute;cil de usar, su arquitectura define claramente 
        una separaci&oacute;n entre las capas de l&oacute;gica y presentaci&oacute;n 
        permitiendo que la conexi&oacute;n entre ambas sea sencilla.<br>
        Este dise&ntilde;o posibilita a cada miembro del equipo de desarrollo 
        centrarse en la parte de la aplicaci&oacute;n que le corresponde desarrollar, 
        proporcionando adem&aacute;s un modelo de programaci&oacute;n sencilla 
        que simplifica la posterior uni&oacute;n de todos los m&oacute;dulos. 
        De esta forma, desarrolladores Web sin experiencia pueden utilizar componentes 
        UI de JSF en sus p&aacute;ginas Web sin escribir apenas c&oacute;digo.<br>
        Por &uacute;ltimo, destacar que JSF resulta atractivo tanto para desarrolladores 
        noveles como expertos. Los primeros podr&aacute;n comprobar c&oacute;mo 
        se a&ntilde;aden componentes a una p&aacute;gina con un simple &#8220;drag 
        and drop&#8221; (es f&aacute;cil de usar y muy visual) mientras que los 
        segundos encontrar&aacute;n un est&aacute;ndar robusto que les ofrece 
        mucho potencial y flexibilidad para programar.</p>
      <p>&nbsp; </p>
      </td>

  </tr>
  <tr> 
    <td width="341"></td>
    <td width="74">&nbsp;</td>
    <td width="124"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
</body>
</html>
