<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Introducci&oacute;n a JQuery</title>
<META http-equiv=Content-Language content=es>
<META content="Programación,Programas,Aplicaciones,Ejercicios, Ejemplos,Tutoriales,Manuales" name=description>
<meta name="keywords" content="Introduccion a JQuery, Manual JQuery, tutorial JQuery, Ejemplos JQuery, ejercicios JQuery">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos"><tr> 
    <td height="39" colspan="3"> <h2>Videotutorial: Ajax en jQuery</h2></td>
  </tr>
  <tr> 
    <td height="268" colspan="3"> 
      <h3>Introducci&oacute;n</h3>
      <p>Este videotutorial est&aacute; indicado para las personas que quieren 
        dar sus primeros pasos con<br>
        jQuery y desean ver c&oacute;mo se hace una de las tareas m&aacute;s solicitadas 
        dentro de la programaci&oacute;n<br>
        con este popular framework Javascript. Se trata de una conexi&oacute;n 
        Ajax, realizada paso a paso,<br>
        para que todas las personas puedan entenderla.<br>
        En el v&iacute;deo mostraremos c&oacute;mo realizar la p&aacute;gina web 
        que har&aacute; la conexi&oacute;n Ajax, desde el<br>
        principio, incluyendo el script del framework jQuery y luego programando 
        el script de la<br>
        llamada a Ajax. Adem&aacute;s, por complicar un poco m&aacute;s el ejemplo, 
        hemos implementado<br>
        directamente un mensaje de carga, que se mostrar&aacute; cuando se inicie 
        la conexi&oacute;n y se ocultar&aacute;<br>
        una vez que haya terminado con &eacute;xito.<br>
        Los art&iacute;culos que deber&iacute;an leerse como complemento a este 
        v&iacute;deo son Uso de Ajax muy sencillo con jQuery y el siguiente cap&iacute;tulo 
        del<br>
        manual llamado Ajax jQuery con mensaje de carga.<br>
        El proceso de realizaci&oacute;n de una solicitud Ajax en jQuery es extremadamente 
        simple, puesto<br>
        que con una &uacute;nica l&iacute;nea de c&oacute;digo se implementa toda 
        la llamada por Ajax e incluso el volcado<br>
        de la respuesta en un elemento de la p&aacute;gina. Sin embargo, se requieren 
        diversas l&iacute;neas de<br>
        c&oacute;digo adicionales para realizar cosas como la ejecuci&oacute;n 
        de c&oacute;digo s&oacute;lo cuando el navegador<br>
        est&aacute; listo para recibir acciones que modifiquen el DOM, la codificaci&oacute;n 
        de un evento para que<br>
        se solicite la p&aacute;gina por Ajax como respuesta a un clic del usuario 
        que visita la p&aacute;gina, etc.<br>
        Adem&aacute;s, el script, como dec&iacute;amos, tambi&eacute;n realiza 
        la tarea de mostrar un mensaje de carga<br>
        mientras que la solicitud est&aacute; pendiente, con lo que hay que agregar 
        alguna l&iacute;nea de c&oacute;digo<br>
        adicional tambi&eacute;n por este motivo. Luego haremos un peque&ntilde;o 
        script PHP que tenga un<br>
        retardo, para que la solicitud Ajax tarde un poco m&aacute;s en obtener 
        respuesta y podamos llegar a<br>
        ver el mensaje de carga.<br>
        Como se podr&aacute; ver en el videotutorial, esta tarea no tiene mucha 
        dificultad, pero ser&aacute;n<br>
        necesarios conocimientos de varios &aacute;mbitos para poder entenderla 
        toda.<br>
        Por cierto, durante el v&iacute;deo trabajamos con un editor de texto 
        para programadores llamado<br>
        Komodo Edit, lo que puede resultar de inter&eacute;s para las personas 
        que no conozcan este editor<br>
        de c&oacute;digo fuente gratuito. Komodo Edit tiene un previsualizador 
        que nos permite ver en<br>
        ejecuci&oacute;n, durante las primeras pruebas, la p&aacute;gina que vamos 
        realizando. Aunque la parte en<br>
        la que trabajamos con PHP la tenemos que ejecutar a trav&eacute;s de un 
        servidor web y luego ver en<br>
        un navegador. Nosotros como servidor web utilizamos Wamp, que instala 
        en un solo paso todo<br>
        lo necesario para ejecutar p&aacute;ginas PHP.<br>
        El v&iacute;deo lo hemos publicado en YouTube y producido en menos de 
        10 minutos, por<br>
        requerimientos de dicho sitio web. No obstante, creemos que ha quedado 
        un videotutorial<br>
        suficientemente claro y con las necesarias explicaciones para que todas 
        las personas puedan<br>
        entenderlo prestando suficiente atenci&oacute;n.<br>
        Sin m&aacute;s, os dejamos con este v&iacute;deo que esperamos pueda servir 
        de utilidad a todas las<br>
        personas que quieren desarrollar sus p&aacute;ginas con Ajax y utilizar 
        una de las herramientas m&aacute;s<br>
        populares para facilitarnos la vida al programar p&aacute;ginas con scripts 
        del lado del cliente.</p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
