<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Introducci&oacute;n a JQuery</title>
<META http-equiv=Content-Language content=es>
<META content="Programación,Programas,Aplicaciones,Ejercicios, Ejemplos,Tutoriales,Manuales" name=description>
<meta name="keywords" content="Introduccion a JQuery, Manual JQuery, tutorial JQuery, Ejemplos JQuery, ejercicios JQuery">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos"><tr> 
    <td height="39" colspan="3"> <h2>Vídeo: comenzar a programar con jQuery</h2></td>
  </tr>
  <tr> 
    <td height="268" colspan="3"><p>En este primer v&iacute;deo se muestra desde 
        el principio la creaci&oacute;n de un primer ejemplo con<br>
        jQuery. Comenzaremos mostrando algo tan sencillo como descargar el framework 
        e incluirlo en<br>
        una p&aacute;gina HTML. En el videotutorial realizaremos luego un script 
        sencillo para probar que<br>
        todo est&aacute; funcionando correctamente y de paso ver como con jQuery 
        podemos crear<br>
        funcionalidades din&aacute;micas en p&aacute;ginas web con realmente poco 
        esfuerzo.<br>
        En el v&iacute;deo se ver&aacute;n r&aacute;pidamente muchos conceptos 
        que no se llegan a explicar con detalle,<br>
        puesto que para hacer un primer ejemplo se necesitan utilizar varios componentes 
        que son<br>
        complicados de explicar con detalle sin conocimientos previos. El objetivo 
        no es sino mostrar<br>
        c&oacute;mo cualquier persona puede hacer r&aacute;pidamente un script 
        con jQuery en pocos minutos. No<br>
        obstante, en este v&iacute;deo seguimos el gui&oacute;n que se explic&oacute; 
        en el art&iacute;culo Primeros pasos con<br>
        jQuery, donde encontraremos diversas gu&iacute;as adicionales, comentadas 
        con m&aacute;s calma. Para<br>
        poder publicar el v&iacute;deo en Youtube, nos hemos limitado a una duraci&oacute;n 
        de 10 minutos, por lo<br>
        que algunas veces merecer&aacute; la pena consultar el mencionado art&iacute;culo.<br>
        El ejemplo que realizaremos a lo largo de este v&iacute;deo se puede ver 
        en una p&aacute;gina aparte.<br>
        As&iacute; pues, esperamos que este videotutorial sirva de utilidad a 
        las personas que quieren<br>
        empezar a programar con jQuery y no sepan por donde empezar.<br>
        Claro que estos ejercicios son un poco especiales, dado que sirven para 
        ilustrar el modo de<br>
        trabajo con jQuery, pero sin explicar todos los detalles relacionados 
        con el uso del framework.<br>
        Por que de momento lo que queremos es mostrar una introducci&oacute;n 
        al sistema y mostrar por<br>
        encima algunas de sus posibilidades. En el futuro publicaremos art&iacute;culos 
        que ir&aacute;n poco a poco<br>
        explicando todos los detalles de trabajo con jQuery.<br>
        En el caso que nos ocupa, queremos demostrar el uso de jQuery para alterar 
        elementos de una<br>
        p&aacute;gina web, a&ntilde;adiendo y quitando clases CSS. Esto es bien 
        simple, porque en jQuery los<br>
        elementos tienen dos clases llamadas addClass() y removeClass(), que sirven 
        justamente para<br>
        que el elemento que recibe el m&eacute;todo se le aplique una clase CSS 
        o se le elimine. As&iacute; que lo<br>
        que vamos a aprender, con respecto al art&iacute;culo anterior -Pasos 
        para utilizar jQuery-, es utilizar<br>
        esos nuevos m&eacute;todos de los elementos.<br>
        Para complicarlo s&oacute;lo un poco m&aacute;s, vamos a a&ntilde;adir 
        y quitar clases del elemento con respuesta<br>
        a acciones del usuario, para aprender tambi&eacute;n nuevos eventos de 
        usuario.<br>
        En nuestro ejemplo vamos a tener dos elementos. Primero una capa DIV con 
        un texto.<br>
        Despu&eacute;s tendremos un enlace que estar&aacute; fuera de la capa 
        DIV. Al situar el usuario el rat&oacute;n<br>
        sobre un enlace a&ntilde;adiremos una clase CSS a la capa DIV y al retirar 
        el rat&oacute;n del enlace<br>
        eliminaremos la class CSS que hab&iacute;amos a&ntilde;adido antes. Si 
        se desea, para aclarar el caso de<br>
        nuestro ejemplo, podemos ver el ejercicio en marcha en una p&aacute;gina 
        aparte.</p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
