<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Introducci&oacute;n a JQuery</title>
<META http-equiv=Content-Language content=es>
<META content="Programación,Programas,Aplicaciones,Ejercicios, Ejemplos,Tutoriales,Manuales" name=description>
<meta name="keywords" content="Introduccion a JQuery, Manual JQuery, tutorial JQuery, Ejemplos JQuery, ejercicios JQuery">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos"><tr> 
    <td height="39" colspan="3"> <h2>Introducci&oacute;n a JQuery</h2></td>
  </tr>
  <tr> 
    <td height="268" colspan="3"> 
      <h3>Qué es JQuery</h3>
      <p>Para simplificar, podr&iacute;amos decir que jQuery es un framework Javascript, 
        pero quiz&aacute;s muchos<br>
        de los lectores se preguntar&aacute;n qu&eacute; es un framework. Pues 
        es un producto que sirve como base<br>
        para la programaci&oacute;n avanzada de aplicaciones, que aporta una serie 
        de funciones o c&oacute;digos<br>
        para realizar tareas habituales. Por decirlo de otra manera, framework 
        son unas librer&iacute;as de<br>
        c&oacute;digo que contienen procesos o rutinas ya listos para usar. Los 
        programadores utilizan los<br>
        frameworks para no tener que desarrollar ellos mismos las tareas m&aacute;s 
        b&aacute;sicas, puesto que en<br>
        el propio framework ya hay implementaciones que est&aacute;n probadas, 
        funcionan y no se<br>
        necesitan volver a programar.<br>
        Por ejemplo, en el caso que nos ocupa, jQuery es un framework para el 
        lenguaje Javascript,<br>
        luego ser&aacute; un producto que nos simplificar&aacute; la vida para 
        programar en este lenguaje. Como<br>
        probablemente sabremos, cuando un desarrollador tiene que utilizar Javascript, 
        generalmente<br>
        tiene que preocuparse por hacer scripts compatibles con varios navegadores 
        y para ello tiene<br>
        que incorporar mucho c&oacute;digo que lo &uacute;nico que hace es detectar 
        el browser del usuario, para<br>
        hacer una u otra cosa dependiendo de si es Internet Explorer, Firefox, 
        Opera, etc. jQuery es<br>
        donde m&aacute;s nos puede ayudar, puesto que implementa una serie de 
        clases (de programaci&oacute;n<br>
        orientada a objetos) que nos permiten programar sin preocuparnos del navegador 
        con el que<br>
        nos est&aacute; visitando el usuario, ya que funcionan de exacta forma 
        en todas las plataformas m&aacute;s<br>
        habituales.<br>
        As&iacute; pues, este framework Javascript, nos ofrece una infraestructura 
        con la que tendremos<br>
        mucha mayor facilidad para la creaci&oacute;n de aplicaciones complejas 
        del lado del cliente. Por<br>
        ejemplo, con jQuery obtendremos ayuda en la creaci&oacute;n de interfaces 
        de usuario, efectos<br>
        din&aacute;micos, aplicaciones que hacen uso de Ajax, etc. Cuando programemos 
        Javascript con<br>
        jQuery tendremos a nuestra disposici&oacute;n una interfaz para programaci&oacute;n 
        que nos permitir&aacute;<br>
        hacer cosas con el navegador que estemos seguros que funcionar&aacute;n 
        para todos nuestros<br>
        visitantes. Simplemente debemos conocer las librer&iacute;as del framework 
        y programar utilizando<br>
        las clases, sus propiedades y m&eacute;todos para la consecuci&oacute;n 
        de nuestros objetivos.<br>
        Adem&aacute;s, todas estas ventajas que sin duda son muy de agradecer, 
        con jQuery las obtenemos<br>
        de manera gratuita, ya que el framework tiene licencia para uso en cualquier 
        tipo de<br>
        plataforma, personal o comercial. Para ello simplemente tendremos que 
        incluir en nuestras<br>
        p&aacute;ginas un script Javascript que contiene el c&oacute;digo de jQuery, 
        que podemos descargar de la<br>
        propia p&aacute;gina web del producto y comenzar a utilizar el framework.<br>
        El archivo del framework ocupa unos 56 KB, lo que es bastante razonable 
        y no retrasar&aacute;<br>
        mucho la carga de nuestra p&aacute;gina (si nuestro servidor env&iacute;a 
        los datos comprimidos, lo <br>
        que esbastante normal, el peso de jQuery ser&aacute; de unos 19 KB). Adem&aacute;s, 
        nuestro servidor lo enviar&aacute;<br>
        al cliente la primera vez que visite una p&aacute;gina del sitio. En siguientes 
        p&aacute;ginas el cliente ya<br>
        tendr&aacute; el archivo del framework, por lo que no necesitar&aacute; 
        transferirlo y lo tomar&aacute; de la cach&eacute;.<br>
        Con lo que la carga de la p&aacute;gina s&oacute;lo se ver&aacute; afectada 
        por el peso de este framework una vez<br>
        por usuario. Las ventajas a la hora de desarrollo de las aplicaciones, 
        as&iacute; como las puertas que<br>
        nos abre jQuery compensan extraordinariamente el peso del paquete. </p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
