<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Indice J2ME</title>
<META http-equiv=Content-Language content=es>
<META content="Manual J2ME, ejemplos J2ME, codigos J2ME" name=description>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="keywords" content="Manual J2ME, ejemplos J2ME, codigos J2ME">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>


<body>
<table class="tablaContenidos">

  <tr> 
    <td height="39" colspan="3"> <h2>Tipos de juegos interactivos</h2></td>
  </tr>
  <tr> 
    <td height="258" colspan="3"> <p>Otra cuesti&oacute;n a abarcar antes de centrarnos 
        en los conceptos t&eacute;cnicos del desarrollo de juegos en J2ME es los 
        tipos de juegos que podremos generar. Una divisi&oacute;n com&uacute;n 
        es la siguiente:<br>
        - VideoAventura. En los juegos de videoAventura se desarrolla una historia 
        donde el usuario tiene que ir encontrando pistas que descubrir&aacute;n 
        misterios y avances en la historia. En este tipo de juegos, los guiones 
        y di&aacute;logos deben estar muy logrados para que la historia mantenga 
        la atenci&oacute;n del usuario. Si se tiene en mente la sencillez anterior 
        y se consigue ofrecer la historia de forma llamativa, son factibles de 
        llevar a MIDP.122<br>
        <br>
        Ejemplos: Day of Tentacle, Monkey Island...<br>
        - Arcade. Los juegos arcade fueron los primeros que aparecieron en el 
        mercado, respondiendo a una estructura fundamentada en actividades de 
        mucha destreza, que permiten al usuario recorrer distintas pantallas en 
        diferentes niveles. La rapidez en este tipo de juegos es el elemento m&aacute;s 
        importante, incluso m&aacute;s que la propia estrategia del juego.<br>
        En esta divisi&oacute;n, los arcade engloban tanto a los t&iacute;picos 
        juegos de plataformas, muy orientados a dispositivos m&oacute;viles; como 
        a los de acci&oacute;n en primera persona, los cuales a&uacute;n no entran 
        demasiado bien en MIDP.<br>
        Ejemplos: Mario Bros, Doom...<br>
        - Deportivos. Recrean alg&uacute;n tipo de deporte, requiriendo habilidad, 
        rapidez y precisi&oacute;n. Una de las facetas m&aacute;s importantes 
        de estos juegos es la jugabilidad. El usuario debe tener control total 
        sobre el personaje que maneje. Adem&aacute;s, tambi&eacute;n tiene una 
        gran importancia la calidad gr&aacute;fica, digitalizando deportistas 
        y recre&aacute;ndolos de una manera muy real.<br>
        Ejemplos: Decathlon, Pro soccer...<br>
        - Estrategia. El usuario de juegos estrat&eacute;gicos necesita coordinar 
        acciones y actuar con el fin de conseguir una finalidad concreta. Ofrecen 
        al jugador la posibilidad de aumentar su capacidad de reflexi&oacute;n 
        para as&iacute; conseguir un objetivo propuesto. La mayor&iacute;a de 
        los juegos de estrategia permiten manejar m&aacute;s de un personaje, 
        hasta tropas de soldados.<br>
        Ejemplos: Comandos, SimCity...<br>
        - Rol. En este tipo de juegos el usuario maneja un personaje, el cual 
        se ha podido crear con unas cualidades concretas, que va evolucionando 
        durante el juego seg&uacute;n las decisiones o caminos que tome el usuario. 
        Suelen ser juegos en los que el objetivo no es &uacute;nico, sino que 
        hay varias metas que se entrelazan. Estos juegos suponen muchas horas 
        de juego, al igual que los de estrategia.<br>
        Ejemplos: Diablo, Baldur&acute;s Gate...En los dos tipos de juegos anteriores 
        se podr&iacute;a aprovechar la capacidad de juego online (estas modalidades 
        de juego est&aacute;n muy orientados a ello, juegos multijugador con un 
        servidor HTTP por detr&aacute;s como organizador) que dispondremos f&aacute;cilmente<br>
        con un dispositivo m&oacute;vil, siempre que cumplamos ciertas normas 
        de sencillez. M&aacute;s adelante comentaremos de nuevo lo llamativo de 
        este tipo de comunicaci&oacute;n.<br>
        - Simulaci&oacute;n. Los juegos de simulaci&oacute;n sumergen al usuario 
        en un mundo donde se reproduce alg&uacute;n tipo de acci&oacute;n como, 
        por ejemplo, pilotar un avi&oacute;n, conducir un coche de carreras, etc.<br>
        Cada vez se les intenta dar mayor realismo, lo que conlleva un tiempo 
        de aprendizaje excesivo por la complejidad de manejo de este tipo de juegos. 
        Adem&aacute;s, pensando en dispositivos m&oacute;viles, la gr&aacute;fica 
        que necesitan (si desean llegar a un cierto realismo) no ser&aacute; posible 
        ofrecerla en un dispositivo MIDP.<br>
        Ejemplos: Flight Simulator, Xpand Rally... </p>
      </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
