<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>&iquest;Qu&eacute; es el XML?</title>
<META http-equiv=Content-Language content=es>
<META content="Programación en CSS,Programas CSS,Aplicaciones en CSS,Ejercicios en CSS, Ejemplos de CSS,Tutoriales de CSS,Manuales CSS" name=description>
<meta name="keywords" content="CSS, Manual CSS, tutorial CSS, Ejemplos CSS, ejercicios CSS, Cascading Style Sheet">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<META content=euskalnet.net/jaoprogramador name=author>
<META content="Copyright (c) 2005 jaoprogramador" name=copyright>
<META scheme=RFC1766 content=español name=DC.Language>
<META content=es,sp,spanish,español name=lang>
<META content=all name=robots>
<link href="../../styles/estilos.css" rel="stylesheet" type="text/css">
</head>

<body>
<table class="tablaContenidos"><tr> 
    <td height="39" colspan="3"> <h2> <strong>&iquest;Qu&eacute; es el XML? </strong> </h2></td>
  </tr>
  <tr> 
    <td height="258" colspan="3"> 
      <p>Es el est&aacute;ndar de Extensible Markup Lenguaje. XML no es m&aacute;s que un conjunto de reglas para definir etiquetas sem&aacute;nticas que nos organizan un documento en diferentes partes. XML es un metalenguaje que define la sintaxis utilizada para definir otros lenguajes de etiquetas estructurados. </p>
      <p>De hecho, HTML es simplemente un lenguaje, mientras que XML como se ha dicho es un metalenguaje, esto es, un lenguaje para definir lenguajes. Y esa es la diferencia fundamental, de la que deriban las dem&aacute;s, que iremos viendo a lo largo del documento. </p>
      <p>&nbsp; </p>
      <p>XML proporciona a las empresas el camino para el intercambio de informaci&oacute;n. Por eso estas prefieren los formatos XML a otros porque es mas f&aacute;cil de interpretar y de manipular se pod&iacute;ra decir que es casi auto descriptivo. De esta forma, si se recibe una cadena de texto normal sin ningun identificador y la tenemos que interpretar resulta dif&iacute;cil saber que es exactamente , pero si ese texto va acompa&ntilde;ado de unas marcas, si que podemos identificarla(transforma los datos a informaci&oacute;n descriptiva). Es un meta markup language(metalenguaje de marcas) y es extensible ya que no es un formato prefijado como HTML. </p>
      <p>XML refuerza el impacto de Internet en el mundo empresarial ya que se integran de esta forma m&aacute;s r&aacute;pidamente. Es decir, si queremos modificar la prsentaci&oacute;n o contenido de p&aacute;ginas se requiere menos tiempo y recursos humanos utilizando XML que otro formato. </p>
      <p>&nbsp; </p>
      <p>Es el futuro lenguaje de la web aunque por ahora no lo sustituir&aacute;. Esto es debido a que los navegadores actuales solo interpretan HTML. Existen browsers que dicen entender XML , aunque en realidad tienen que transformar este lenguaje para poder presentarlo. </p>
      <p>&nbsp; </p>
      <p>El uso de XML elimina la libertad del HTML que es an&aacute;rquico, y nos presenta el XHTML que debe seguir unas normas. El Extensible Markup Lenguaje es un est&aacute;ndar desarrollado por el grupo W3C o Word Wide Web Consortium (www.w3.org) para textos estructurados.. Este grupo se dedica a definir estandares en los que las empresas de software se basan posteriormente para crear sus aplicaciones.Existen otros subgrupos del W3C como es el grupo OASIS que pretende la estandarizaci&oacute;n de los documentos y as&iacute; permite el intercambio de estos facilmente y las complicaciones que se producir&iacute;an con documentos con diferentes estructuras. Este grupo tiene ya definido un cat&aacute;logo de XML con DTD estandarizados, de esta forma las ramas sanitarias (HL7), qu&iacute;micas farmace&uacute;ticas (CML) financieras(VisaXML, IFX, BIPS), del turismo/viajes (OTA), de la prensa/publicitarias (aXML), etc. puede intercambiarse documentos con un DTD ya definido y estandarizado, y por lo tanto sin complicaciones. </p>
      <p>&nbsp; </p>
      <p>Actualmente hay 2 versiones de XML:1.0 y 1.1 aunque la mayor&iacute;a de los parsers (procesadores) por ahora s&oacute;lo reconocen la versi&oacute;n 1.0. </p>
      <p>&nbsp; </p>
      <p>El XML separa contenido de estructura, es decir podemos saber si un documento est&aacute; bien formato sin saber qu&eacute; es lo que contiene. Todo elemento del documento tiene un principio y un final, y entre esas dos etiquetas tendremos en valor del elemento, aunque tambien puede contener otros elementos. </p>
      <p>&nbsp; </p>
      <p>&lt;?xml version=" 1.0" encoding="ISO-8859- 1" ?&gt; </p>
      <p>&lt;informe&gt; </p>
      <p>&lt;fecha&gt;17/5/1990&lt;/fecha&gt; </p>
      <p>&lt;hora&gt;14:00&lt;/hora&gt; </p>
      <p>&lt;area&gt; </p>
      <p>&lt;ciudad&gt;Le&oacute;n&lt;/ciudad&gt; </p>
      <p>&lt;region&gt;Castilla Leon&lt;/region&gt; </p>
      <p>&lt;pais&gt;Espa&ntilde;a&lt;/pais&gt; </p>
      <p>&lt;/area&gt; </p>
      <p>&lt;mediciones&gt; </p>
      <p>&lt;cielo&gt;claro&lt;/cielo&gt; </p>
      <p>&lt;temperatura escala="C"&gt;25&lt;/temperatura&gt; </p>
      <p>&lt;/mediciones&gt; </p>
      <p>&nbsp; </p>
      <p>&lt;/informe&gt; </p>
      <p>&nbsp; </p>
      <p>En el ejemplo &lt;area&gt; es un elemento que contiene otros elementos y &lt;ciudad&gt; es un elemento que contiene un valor. </p>
    <h3>&nbsp;</h3>    </td>
  </tr>
  <tr> 
    <td width="66" height="21"></td>
    <td width="324" height="21">&nbsp;</td>
    <td width="149"><div align="right"><a href="../index.htm" target="_parent">&lt;&lt;Men&uacute; 
        Inicio</a></div></td>
  </tr>
</table>
<p>&nbsp;</p>
</body>
</html>
